


Network Working Group                                        F. Thompson
Internet-Draft                                            Afilias Canada
Intended status: Informational                          October 17, 2007
Expires: April 19, 2008


           Extensible Supply-chain Discovery Service Commands
                    draft-thompson-esds-commands-01

Status of this Memo

   By submitting this Internet-Draft, each author represents that any
   applicable patent or other IPR claims of which he or she is aware
   have been or will be disclosed, and any of which he or she becomes
   aware will be disclosed, in accordance with Section 6 of BCP 79.

   Internet-Drafts are working documents of the Internet Engineering
   Task Force (IETF), its areas, and its working groups.  Note that
   other groups may also distribute working documents as Internet-
   Drafts.

   Internet-Drafts are draft documents valid for a maximum of six months
   and may be updated, replaced, or obsoleted by other documents at any
   time.  It is inappropriate to use Internet-Drafts as reference
   material or to cite them other than as "work in progress."

   The list of current Internet-Drafts can be accessed at
   http://www.ietf.org/ietf/1id-abstracts.txt.

   The list of Internet-Draft Shadow Directories can be accessed at
   http://www.ietf.org/shadow.html.

   This Internet-Draft will expire on April 19, 2008.

Copyright Notice

   Copyright (C) The IETF Trust (2007).














Thompson                 Expires April 19, 2008                 [Page 1]

Internet-Draft                ESDS Commands                 October 2007


Abstract

   The Extensible Supply-chain Discovery Service (ESDS) is an
   application layer protocol for the distributed sharing and discovery
   of notification events between associated partners within a supply
   chain.  This document describes the details of the command interface
   of the ESDS.  A full outline of all primary and support commands is
   included in this document along with examples.

   Comments are solicited and should be addressed to the mailing list at
   esds@ietf.org and/or the author(s).


Table of Contents

   1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . .   5
     1.1.  Conventions Used In This Document . . . . . . . . . . . .   5
   2.  Client Request  . . . . . . . . . . . . . . . . . . . . . . .   6
   3.  Server Response . . . . . . . . . . . . . . . . . . . . . . .   7
     3.1.  Result Codes  . . . . . . . . . . . . . . . . . . . . . .   7
   4.  Primary Object Commands . . . . . . . . . . . . . . . . . . .  13
     4.1.  <UserLogin> . . . . . . . . . . . . . . . . . . . . . . .  13
       4.1.1.  Request . . . . . . . . . . . . . . . . . . . . . . .  13
       4.1.2.  Response  . . . . . . . . . . . . . . . . . . . . . .  14
     4.2.  <UserLogout>  . . . . . . . . . . . . . . . . . . . . . .  16
       4.2.1.  Request . . . . . . . . . . . . . . . . . . . . . . .  16
       4.2.2.  Response  . . . . . . . . . . . . . . . . . . . . . .  17
     4.3.  <Hello> . . . . . . . . . . . . . . . . . . . . . . . . .  18
       4.3.1.  Request . . . . . . . . . . . . . . . . . . . . . . .  19
       4.3.2.  Response  . . . . . . . . . . . . . . . . . . . . . .  20
     4.4.  <EventCreate> . . . . . . . . . . . . . . . . . . . . . .  22
       4.4.1.  Request . . . . . . . . . . . . . . . . . . . . . . .  22
       4.4.2.  Response  . . . . . . . . . . . . . . . . . . . . . .  24
     4.5.  <EventInfo> . . . . . . . . . . . . . . . . . . . . . . .  26
       4.5.1.  Request . . . . . . . . . . . . . . . . . . . . . . .  26
       4.5.2.  Response  . . . . . . . . . . . . . . . . . . . . . .  28
     4.6.  <EventLookup> . . . . . . . . . . . . . . . . . . . . . .  30
       4.6.1.  Request . . . . . . . . . . . . . . . . . . . . . . .  30
       4.6.2.  Response  . . . . . . . . . . . . . . . . . . . . . .  32
   5.  Support Object Commands . . . . . . . . . . . . . . . . . . .  35
     5.1.  <Lookup>  . . . . . . . . . . . . . . . . . . . . . . . .  35
       5.1.1.  Request . . . . . . . . . . . . . . . . . . . . . . .  35
       5.1.2.  Response  . . . . . . . . . . . . . . . . . . . . . .  36
     5.2.  <RoleCreate>  . . . . . . . . . . . . . . . . . . . . . .  38
       5.2.1.  Request . . . . . . . . . . . . . . . . . . . . . . .  38
       5.2.2.  Response  . . . . . . . . . . . . . . . . . . . . . .  39
     5.3.  <RoleInfo>  . . . . . . . . . . . . . . . . . . . . . . .  41
       5.3.1.  Request . . . . . . . . . . . . . . . . . . . . . . .  41



Thompson                 Expires April 19, 2008                 [Page 2]

Internet-Draft                ESDS Commands                 October 2007


       5.3.2.  Response  . . . . . . . . . . . . . . . . . . . . . .  42
     5.4.  <RoleUpdate>  . . . . . . . . . . . . . . . . . . . . . .  44
       5.4.1.  Request . . . . . . . . . . . . . . . . . . . . . . .  45
       5.4.2.  Response  . . . . . . . . . . . . . . . . . . . . . .  46
     5.5.  <RoleDelete>  . . . . . . . . . . . . . . . . . . . . . .  48
       5.5.1.  Request . . . . . . . . . . . . . . . . . . . . . . .  48
       5.5.2.  Response  . . . . . . . . . . . . . . . . . . . . . .  49
     5.6.  <RoleLookup>  . . . . . . . . . . . . . . . . . . . . . .  50
       5.6.1.  Request . . . . . . . . . . . . . . . . . . . . . . .  50
       5.6.2.  Response  . . . . . . . . . . . . . . . . . . . . . .  52
     5.7.  <UserCreate>  . . . . . . . . . . . . . . . . . . . . . .  53
       5.7.1.  Request . . . . . . . . . . . . . . . . . . . . . . .  53
       5.7.2.  Response  . . . . . . . . . . . . . . . . . . . . . .  57
     5.8.  <UserInfo>  . . . . . . . . . . . . . . . . . . . . . . .  58
       5.8.1.  Request . . . . . . . . . . . . . . . . . . . . . . .  58
       5.8.2.  Response  . . . . . . . . . . . . . . . . . . . . . .  61
     5.9.  <UserUpdate>  . . . . . . . . . . . . . . . . . . . . . .  65
       5.9.1.  Request . . . . . . . . . . . . . . . . . . . . . . .  65
       5.9.2.  Response  . . . . . . . . . . . . . . . . . . . . . .  68
     5.10. <UserDelete>  . . . . . . . . . . . . . . . . . . . . . .  70
       5.10.1. Request . . . . . . . . . . . . . . . . . . . . . . .  70
       5.10.2. Response  . . . . . . . . . . . . . . . . . . . . . .  71
     5.11. <UserLookup>  . . . . . . . . . . . . . . . . . . . . . .  72
       5.11.1. Request . . . . . . . . . . . . . . . . . . . . . . .  72
       5.11.2. Response  . . . . . . . . . . . . . . . . . . . . . .  74
     5.12. <PartnerCreate> . . . . . . . . . . . . . . . . . . . . .  75
       5.12.1. Request . . . . . . . . . . . . . . . . . . . . . . .  75
       5.12.2. Response  . . . . . . . . . . . . . . . . . . . . . .  77
     5.13. <PartnerInfo> . . . . . . . . . . . . . . . . . . . . . .  79
       5.13.1. Request . . . . . . . . . . . . . . . . . . . . . . .  79
       5.13.2. Response  . . . . . . . . . . . . . . . . . . . . . .  80
     5.14. <PartnerUpdate> . . . . . . . . . . . . . . . . . . . . .  82
       5.14.1. Request . . . . . . . . . . . . . . . . . . . . . . .  82
       5.14.2. Response  . . . . . . . . . . . . . . . . . . . . . .  84
     5.15. <PartnerDelete> . . . . . . . . . . . . . . . . . . . . .  86
       5.15.1. Request . . . . . . . . . . . . . . . . . . . . . . .  86
       5.15.2. Response  . . . . . . . . . . . . . . . . . . . . . .  86
     5.16. <PartnerLookup> . . . . . . . . . . . . . . . . . . . . .  87
       5.16.1. Request . . . . . . . . . . . . . . . . . . . . . . .  87
       5.16.2. Response  . . . . . . . . . . . . . . . . . . . . . .  88
     5.17. <SupplyChainCreate> . . . . . . . . . . . . . . . . . . .  90
       5.17.1. Request . . . . . . . . . . . . . . . . . . . . . . .  90
       5.17.2. Response  . . . . . . . . . . . . . . . . . . . . . .  92
     5.18. <SupplyChainInfo> . . . . . . . . . . . . . . . . . . . .  94
       5.18.1. Request . . . . . . . . . . . . . . . . . . . . . . .  94
       5.18.2. Response  . . . . . . . . . . . . . . . . . . . . . .  95
     5.19. <SupplyChainUpdate> . . . . . . . . . . . . . . . . . . .  97
       5.19.1. Request . . . . . . . . . . . . . . . . . . . . . . .  98



Thompson                 Expires April 19, 2008                 [Page 3]

Internet-Draft                ESDS Commands                 October 2007


       5.19.2. Response  . . . . . . . . . . . . . . . . . . . . . .  99
     5.20. <SupplyChainDelete> . . . . . . . . . . . . . . . . . . . 101
       5.20.1. Request . . . . . . . . . . . . . . . . . . . . . . . 101
       5.20.2. Response  . . . . . . . . . . . . . . . . . . . . . . 102
     5.21. <SupplyChainLookup> . . . . . . . . . . . . . . . . . . . 103
       5.21.1. Request . . . . . . . . . . . . . . . . . . . . . . . 103
       5.21.2. Response  . . . . . . . . . . . . . . . . . . . . . . 105
   6.  IANA Considerations . . . . . . . . . . . . . . . . . . . . . 107
   7.  Security Considerations . . . . . . . . . . . . . . . . . . . 108
   8.  References  . . . . . . . . . . . . . . . . . . . . . . . . . 109
     8.1.  Normative References  . . . . . . . . . . . . . . . . . . 109
     8.2.  Informative References  . . . . . . . . . . . . . . . . . 109
   Author's Address  . . . . . . . . . . . . . . . . . . . . . . . . 110
   Intellectual Property and Copyright Statements  . . . . . . . . . 111





































Thompson                 Expires April 19, 2008                 [Page 4]

Internet-Draft                ESDS Commands                 October 2007


1.  Introduction

   This document provides a detailed outline of the command interface
   for the Extensible Supply-chain Discovery Service (ESDS) and includes
   examples.  Extensible Supply-chain Discovery Service Concepts
   [draft-young-esds-concepts] introduces the ESDS and provides
   conceptual information about the protocol.  Extensible Supply-chain
   Discovery Service Schema [draft-thompson-esds-schema] details the
   schema for the ESDS, which is specified in Web Service Description
   Language (WSDL) and XML Schema (XSD).

1.1.  Conventions Used In This Document

   The key words "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT",
   "SHOULD", "SHOULD NOT", "RECOMMENDED", "MAY", and "OPTIONAL" in this
   document are to be interpreted as described in [RFC2119].

   In examples, "C:" represents lines sent by a protocol client and "S:"
   represents lines returned by a protocol server.  Indentation and
   white space in examples is provided only to illustrate element
   relationships and is not a REQUIRED feature of this protocol.






























Thompson                 Expires April 19, 2008                 [Page 5]

Internet-Draft                ESDS Commands                 October 2007


2.  Client Request

   Commands within the ESDS are invoked as client requests, which in
   turn result in server responses.  This client/server conversation is
   expressed as SOAP/XML with the following basic structure for each
   request.  The details of the protocol syntax can be found in the ESDS
   Schema [draft-thompson-esds-schema].


   <?xml version="1.0" encoding="utf-8"?>
   <SOAP-ENV:Envelope
     xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
     xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
     xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
     xmlns:xsd="http://www.w3.org/2001/XMLSchema"
     xmlns:esdsw="urn:ietf:params:wsdl:ns:esds-1.0"
     xmlns:esds="urn:ietf:params:xsd:ns:esds-1.0">
     <SOAP-ENV:Body>

       <esds: ...>

       .
       .
       .

       </esds: ...>

     </SOAP-ENV:Body>
   </SOAP-ENV:Envelope>






















Thompson                 Expires April 19, 2008                 [Page 6]

Internet-Draft                ESDS Commands                 October 2007


3.  Server Response

   Client command requests will result in a server response with the
   following basic structure expressed in SOAP/XML.  The detailed server
   response syntax can be found in the ESDS Schema
   [draft-thompson-esds-schema].


   <?xml version="1.0" encoding="utf-8"?>
   <SOAP-ENV:Envelope
     xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
     xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
     xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
     xmlns:xsd="http://www.w3.org/2001/XMLSchema"
     xmlns:esdsw="urn:ietf:params:wsdl:ns:esds-1.0"
     xmlns:esds="urn:ietf:params:xsd:ns:esds-1.0">
     <SOAP-ENV:Body>

       <esds: ... Result>
         xsi:type="esds:EventLookupOut">

         <result
           xsi:type="esds:tResult"
           code="1000"
           desc="Command completed successfully">
           <value
             xsi:type="xs:string">
             </value>
         </result>

       </esds: ... Result>

     </SOAP-ENV:Body>
   </SOAP-ENV:Envelope>


3.1.  Result Codes

   ESDS result codes are based almost verbatim on those found in
   [RFC4930].  Re-use of these result codes and the client-server
   semantics has been done in an effort to adopt existing standards.
   Full credit MUST be given to the author of the EPP RFC [RFC4930].

   ESDS result codes are based on the theory of reply codes described in
   section 4.2.1 of [RFC2821].  ESDS uses four decimal digits to
   describe the success or failure of each ESDS command.  Each of the
   digits of the reply have special significance.




Thompson                 Expires April 19, 2008                 [Page 7]

Internet-Draft                ESDS Commands                 October 2007


   The first digit denotes command success or failure.  The second digit
   denotes the response category, such as command syntax or security.
   The third and fourth digits provide explicit response detail within
   each response category.

   There are two values for the first digit of the reply code:

   1yzz Positive completion reply.
   The command has been accepted and processed by the system without
   error.

   2yzz Negative completion reply.
   The command was not accepted and the requested action did not occur.

   The second digit groups responses into one of six specific
   categories:

   x0zz Protocol Syntax
   x1zz Implementation-specific Rules
   x2zz Security
   x3zz Data Management
   x4zz Server System
   x5zz Connection Management

   The third and fourth digits provide response detail within the
   categories defined by the first and second digits.  Specific result
   codes are listed in the table below.

   Every ESDS response MUST include a result code and a human-readable
   description of the result code.

   Response text in the table below is enclosed in quotes to clearly
   mark the beginning and ending of each response string.  Quotes MUST
   NOT be used to delimit these strings when returning response text via
   the protocol.

   Successful command completion responses:

   o  Code Response text in English
      _____________________________

   o  1000 "Command completed successfully"
      This is the usual response code for a successfully completed
      command that is not addressed by any other 1xxx-series response
      code.

   o  1001 "Command completed successfully; action pending"
      This response code MUST be returned when responding to a command



Thompson                 Expires April 19, 2008                 [Page 8]

Internet-Draft                ESDS Commands                 October 2007


      that requires offline activity before the requested action can be
      completed.  See section 2 for a description of other processing
      requirements.

   o  1500 "Command completed successfully; ending session"
      This response code MUST be returned when responding to a
      successful <UserLogout> command.

   Command error responses:

   o  Code Response text in English
      _____________________________

   o  2000 "Unknown command"
      This response code MUST be returned when a server receives a
      command element that is not defined by ESDS.

   o  2001 "Command syntax error"
      This response code MUST be returned when a server receives an
      improperly formed command element.

   o  2002 "Command use error"
      This response code MUST be returned when a server receives a
      properly formed command element, but the command cannot be
      executed due to a sequencing or context error.  For example, a
      <UserLogout> command cannot be executed without having first
      completed a <UserLogin> command.

   o  2003 "Required parameter missing"
      This response code MUST be returned when a server receives a
      command for which a required parameter value has not been
      provided.

   o  2004 "Parameter value range error"
      This response code MUST be returned when a server receives a
      command parameter whose value is outside the range of values
      specified by the protocol.  The error value SHOULD be returned via
      a <value> element in the ESDS response.

   o  2005 "Parameter value syntax error"
      This response code MUST be returned when a server receives a
      command containing a parameter whose value is improperly formed.
      The error value SHOULD be returned via a <value> element in the
      ESDS response.

   o  2100 "Unimplemented protocol version"
      This response code MUST be returned when a server receives a
      command element specifying a protocol version that is not



Thompson                 Expires April 19, 2008                 [Page 9]

Internet-Draft                ESDS Commands                 October 2007


      implemented by the server.

   o  2101 "Unimplemented command"
      This response code MUST be returned when a server receives a valid
      ESDS command element that is not implemented by the server.

   o  2102 "Unimplemented option"
      This response code MUST be returned when a server receives a valid
      ESDS command element that contains a protocol option that is not
      implemented by the server.

   o  2103 "Unimplemented extension"
      This response code MUST be returned when a server receives a valid
      ESDS command element that contains a protocol command extension
      that is not implemented by the server.

   o  2104 "Billing failure"
      This response code MUST be returned when a server attempts to
      execute a billable operation and the command cannot be completed
      due to a client billing failure.

   o  2200 "Authentication error"
      This response code MUST be returned when a server notes an error
      when validating client credentials.

   o  2201 "Authorization error"
      This response code MUST be returned when a server notes a client
      authorization error when executing a command.  This error is used
      to note that a client lacks privileges to execute the requested
      command.

   o  2202 "Invalid authorization information"
      This response code MUST be returned when a server receives invalid
      command authorization information required to confirm
      authorization to execute a command.  This error is used to note
      that a client has the privileges required to execute the requested
      command, but the authorization information provided by the client
      does not match the authorization information archived by the
      server.

   o  2302 "Object exists"
      This response code MUST be returned when a server receives a
      command to create an object that already exists in the repository.

   o  2303 "Object does not exist"
      This response code MUST be returned when a server receives a
      command to query or transform an object that does not exist in the
      repository.



Thompson                 Expires April 19, 2008                [Page 10]

Internet-Draft                ESDS Commands                 October 2007


   o  2304 "Object status prohibits operation"
      This response code MUST be returned when a server receives a
      command to transform an object that cannot be completed due to
      server policy or business practices.

   o  2305 "Object association prohibits operation"
      This response code MUST be returned when a server receives a
      command to transform an object that cannot be completed due to
      dependencies on other objects that are associated with the target
      object.  For example, a server can disallow delete commands while
      an object has active associations with other objects.

   o  2306 "Parameter value policy error"
      This response code MUST be returned when a server receives a
      command containing a parameter value that is syntactically valid,
      but semantically invalid due to local policy.  For example, the
      server can support a subset of a range of valid protocol parameter
      values.  The error value SHOULD be returned via a <value> element
      in the ESDS response.

   o  2307 "Unimplemented object service"
      This response code MUST be returned when a server receives a
      command to operate on an object service that is not supported by
      the server.

   o  2308 "Data management policy violation"
      This response code MUST be returned when a server receives a
      command whose execution results in a violation of server data
      management policies.  For example, removing all attribute values
      or object associations from an object might be a violation of a
      server's data management policies.

   o  2400 "Command failed"
      This response code MUST be returned when a server is unable to
      execute a command due to an internal server error that is not
      related to the protocol.  The failure can be transient.  The
      server MUST keep any ongoing session active.

   o  2500 "Command failed; server closing connection"
      This response code MUST be returned when a server receives a
      command that cannot be completed due to an internal server error
      that is not related to the protocol.  The failure is not
      transient, and will cause other commands to fail as well.  The
      server MUST end the active session and close the existing
      connection.

   o  2501 "Authentication error; server closing connection"
      This response code MUST be returned when a server notes an error



Thompson                 Expires April 19, 2008                [Page 11]

Internet-Draft                ESDS Commands                 October 2007


      when validating client credentials and a server-defined limit on
      the number of allowable failures has been exceeded.  The server
      MUST close the existing connection.

   o  2502 "Session limit exceeded; server closing connection"
      This response code MUST be returned when a server receives a
      <UserLogin> command, and the command cannot be completed because
      the client has exceeded a system-defined limit on the number of
      sessions that the client can establish.  It might be possible to
      establish a session by ending existing unused sessions and closing
      inactive connections.








































Thompson                 Expires April 19, 2008                [Page 12]

Internet-Draft                ESDS Commands                 October 2007


4.  Primary Object Commands

4.1.  <UserLogin>

4.1.1.  Request

   o  Description:

      The ESDS <UserLogin> command is used to create a new session based
      on the credentials provided.  If the transport is HTTP 1.1
      [RFC2616] then a connected session will be valid for the duration
      of the connected client.  HTTP 1.1 keep-alive, if enabled in the
      client and server, will allow multiple commands to execute within
      the connected and authenticated user session.

   o  Elements:

      *  <extension>

         +  Desc: user defined extension xml

         +  Type: tExtension

         +  Use: optional, but no more than 1 occurrence(s)

      *  <userID>

         +  Desc: user identifier

         +  Type: tUserID

         +  Use: required

      *  <password>

         +  Desc: password

         +  Type: tPassword

         +  Use: required











Thompson                 Expires April 19, 2008                [Page 13]

Internet-Draft                ESDS Commands                 October 2007


   C:<?xml version="1.0" encoding="utf-8"?>
   C:<SOAP-ENV:Envelope
   C:  xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
   C:  xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
   C:  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
   C:  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
   C:  xmlns:esdsw="urn:ietf:params:wsdl:ns:esds-1.0"
   C:  xmlns:esds="urn:ietf:params:xsd:ns:esds-1.0">
   C:  <SOAP-ENV:Body>
   C:    <esds:UserLogin
   C:      xsi:type="esds:UserLoginIn">
   C:      <extension
   C:        xsi:type="esds:tExtension">
   C:      </extension>
   C:      <userID
   C:        xsi:type="esds:tUserID">
   C:        U001  </userID>
   C:      <password
   C:        xsi:type="esds:tPassword">
   C:        password  </password>
   C:    </esds:UserLogin>
   C:  </SOAP-ENV:Body>
   C:</SOAP-ENV:Envelope>


4.1.2.  Response

   o  Description:

      When a <UserLogin> operation has been processed successfully, a
      server will respond with an <UserLoginResult>.

   o  Elements:

      *  <result>

         +  Desc: result structure common for each response

         +  Type: tResult

         +  Use: required

      *  <extension>

         +  Desc: user defined extension xml

         +  Type: tExtension




Thompson                 Expires April 19, 2008                [Page 14]

Internet-Draft                ESDS Commands                 October 2007


         +  Use: optional, but no more than 1 occurrence(s)

      *  <sid>

         +  Desc: session identifier

         +  Type: tSessionID

         +  Use: required

      *  <sessionLease>

         +  Desc: session lease

         +  Type: tLeaseSeconds

         +  Use: required


































Thompson                 Expires April 19, 2008                [Page 15]

Internet-Draft                ESDS Commands                 October 2007


   S:<?xml version="1.0" encoding="utf-8"?>
   S:<SOAP-ENV:Envelope
   S:  xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
   S:  xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
   S:  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
   S:  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
   S:  xmlns:esdsw="urn:ietf:params:wsdl:ns:esds-1.0"
   S:  xmlns:esds="urn:ietf:params:xsd:ns:esds-1.0">
   S:  <SOAP-ENV:Body>
   S:    <esds:UserLoginResult
   S:      xsi:type="esds:UserLoginOut">
   S:      <result
   S:        xsi:type="esds:tResult"
   S:        code="1000  "
   S:        desc="COMMAND_COMPLETED_SUCCESSFULLY   ">
   S:        <value
   S:          xsi:type="xs:string">
   S:          value1  </value>
   S:      </result>
   S:      <extension
   S:        xsi:type="esds:tExtension">
   S:      </extension>
   S:      <sid
   S:        xsi:type="esds:tSessionID">
   S:        41xM1R6VD66l5Jb1HO8462Q7hWgDtWr4  </sid>
   S:      <sessionLease
   S:        xsi:type="esds:tLeaseSeconds">
   S:        3600  </sessionLease>
   S:    </esds:UserLoginResult>
   S:  </SOAP-ENV:Body>
   S:</SOAP-ENV:Envelope>


4.2.  <UserLogout>

4.2.1.  Request

   o  Description:

      The ESDS <UserLogout> operation is used to end an existing
      authenticated ESDS session.

   o  Elements:

      *  <sid>

         +  Desc: session identifier




Thompson                 Expires April 19, 2008                [Page 16]

Internet-Draft                ESDS Commands                 October 2007


         +  Type: tSessionID

         +  Use: required

      *  <extension>

         +  Desc: user defined extension xml

         +  Type: tExtension

         +  Use: optional, but no more than 1 occurrence(s)



   C:<?xml version="1.0" encoding="utf-8"?>
   C:<SOAP-ENV:Envelope
   C:  xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
   C:  xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
   C:  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
   C:  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
   C:  xmlns:esdsw="urn:ietf:params:wsdl:ns:esds-1.0"
   C:  xmlns:esds="urn:ietf:params:xsd:ns:esds-1.0">
   C:  <SOAP-ENV:Body>
   C:    <esds:UserLogout
   C:      xsi:type="esds:UserLogoutIn">
   C:      <sid
   C:        xsi:type="esds:tSessionID">
   C:        41xM1R6VD66l5Jb1HO8462Q7hWgDtWr4  </sid>
   C:      <extension
   C:        xsi:type="esds:tExtension">
   C:      </extension>
   C:    </esds:UserLogout>
   C:  </SOAP-ENV:Body>
   C:</SOAP-ENV:Envelope>


4.2.2.  Response

   o  Description:

      When a <UserLogout> operation has been processed successfully, a
      server will respond with a <UserLogoutResult>.

   o  Elements:

      *  <result>





Thompson                 Expires April 19, 2008                [Page 17]

Internet-Draft                ESDS Commands                 October 2007


         +  Desc: result structure common for each response

         +  Type: tResult

         +  Use: required

      *  <extension>

         +  Desc: user defined extension xml

         +  Type: tExtension

         +  Use: optional, but no more than 1 occurrence(s)



   S:<?xml version="1.0" encoding="utf-8"?>
   S:<SOAP-ENV:Envelope
   S:  xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
   S:  xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
   S:  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
   S:  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
   S:  xmlns:esdsw="urn:ietf:params:wsdl:ns:esds-1.0"
   S:  xmlns:esds="urn:ietf:params:xsd:ns:esds-1.0">
   S:  <SOAP-ENV:Body>
   S:    <esds:UserLogoutResult
   S:      xsi:type="esds:UserLogoutOut">
   S:      <result
   S:        xsi:type="esds:tResult"
   S:        code="1000  "
   S:        desc="COMMAND_COMPLETED_SUCCESSFULLY   ">
   S:        <value
   S:          xsi:type="xs:string">
   S:          value1  </value>
   S:      </result>
   S:      <extension
   S:        xsi:type="esds:tExtension">
   S:      </extension>
   S:    </esds:UserLogoutResult>
   S:  </SOAP-ENV:Body>
   S:</SOAP-ENV:Envelope>


4.3.  <Hello>







Thompson                 Expires April 19, 2008                [Page 18]

Internet-Draft                ESDS Commands                 October 2007


4.3.1.  Request

   o  Description:

      The ESDS <Hello> operation is used primarily as a session keep-
      alive operation allowing the connected session identifier to
      maintain its lease within the ESDS. <Hello> also identifies the
      server instance name and current server time.

   o  Elements:

      *  <sid>

         +  Desc: session identifier

         +  Type: tSessionID

         +  Use: required

      *  <extension>

         +  Desc: user defined extension xml

         +  Type: tExtension

         +  Use: optional, but no more than 1 occurrence(s)



   C:<?xml version="1.0" encoding="utf-8"?>
   C:<SOAP-ENV:Envelope
   C:  xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
   C:  xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
   C:  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
   C:  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
   C:  xmlns:esdsw="urn:ietf:params:wsdl:ns:esds-1.0"
   C:  xmlns:esds="urn:ietf:params:xsd:ns:esds-1.0">
   C:  <SOAP-ENV:Body>
   C:    <esds:Hello
   C:      xsi:type="esds:HelloIn">
   C:      <sid
   C:        xsi:type="esds:tSessionID">
   C:        41xM1R6VD66l5Jb1HO8462Q7hWgDtWr4  </sid>
   C:      <extension
   C:        xsi:type="esds:tExtension">
   C:      </extension>
   C:    </esds:Hello>
   C:  </SOAP-ENV:Body>



Thompson                 Expires April 19, 2008                [Page 19]

Internet-Draft                ESDS Commands                 October 2007


   C:</SOAP-ENV:Envelope>


4.3.2.  Response

   o  Description:

      When a <Hello> operation has been processed successfully, a server
      will respond with a <HelloResult>.

   o  Elements:

      *  <result>

         +  Desc: result structure common for each response

         +  Type: tResult

         +  Use: required

      *  <extension>

         +  Desc: user defined extension xml

         +  Type: tExtension

         +  Use: optional, but no more than 1 occurrence(s)

      *  <serverIdentity>

         +  Desc: ESDS server instance identifier

         +  Type: xs:token

         +  Use: required

      *  <serverTS>

         +  Desc: current server timestamp in UTC

         +  Type: xs:dateTime

         +  Use: required

      *  <extensionList>

         +  Desc: list of extensions




Thompson                 Expires April 19, 2008                [Page 20]

Internet-Draft                ESDS Commands                 October 2007


         +  Type: tExtensionItemList

         +  Use: optional, but no more than 1 occurrence(s)



   S:<?xml version="1.0" encoding="utf-8"?>
   S:<SOAP-ENV:Envelope
   S:  xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
   S:  xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
   S:  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
   S:  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
   S:  xmlns:esdsw="urn:ietf:params:wsdl:ns:esds-1.0"
   S:  xmlns:esds="urn:ietf:params:xsd:ns:esds-1.0">
   S:  <SOAP-ENV:Body>
   S:    <esds:HelloResult
   S:      xsi:type="esds:HelloOut">
   S:      <result
   S:        xsi:type="esds:tResult"
   S:        code="1000  "
   S:        desc="COMMAND_COMPLETED_SUCCESSFULLY   ">
   S:        <value
   S:          xsi:type="xs:string">
   S:          value1  </value>
   S:      </result>
   S:      <extension
   S:        xsi:type="esds:tExtension">
   S:      </extension>
   S:      <serverIdentity
   S:        xsi:type="xs:token">
   S:        Acme Discovery Service  </serverIdentity>
   S:      <serverTS
   S:        xsi:type="xs:dateTime">
   S:        2007-01-01T00:00:01.123Z  </serverTS>
   S:      <extensionList
   S:        xsi:type="esds:tExtensionItemList"
   S:        action="replace  ">
   S:        <extension
   S:          xsi:type="esds:tExtensionItem"
   S:          id="urn:ietf:params:ns:esds-sensor-1.0  ">
   S:        </extension>
   S:      </extensionList>
   S:    </esds:HelloResult>
   S:  </SOAP-ENV:Body>
   S:</SOAP-ENV:Envelope>






Thompson                 Expires April 19, 2008                [Page 21]

Internet-Draft                ESDS Commands                 October 2007


4.4.  <EventCreate>

4.4.1.  Request

   o  Description:

      The ESDS <EventCreate> operation is used to create events in the
      system.

   o  Elements:

      *  <sid>

         +  Desc: session identifier

         +  Type: tSessionID

         +  Use: required

      *  <extension>

         +  Desc: user defined extension xml

         +  Type: tExtension

         +  Use: optional, but no more than 1 occurrence(s)

      *  <event>

         +  Desc: event one of (object or void)

         +  Type: tEventTypeChoice

         +  Use: required

      *  <supplyChainID>

         +  Desc: supply chain identifier

         +  Type: tSupplyChainID

         +  Use: required

      *  <proxyPartnerID>

         +  Desc: proxy partner identifier





Thompson                 Expires April 19, 2008                [Page 22]

Internet-Draft                ESDS Commands                 October 2007


         +  Type: tPartnerID

         +  Use: optional, but no more than 1 occurrence(s)



   C:<?xml version="1.0" encoding="utf-8"?>
   C:<SOAP-ENV:Envelope
   C:  xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
   C:  xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
   C:  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
   C:  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
   C:  xmlns:esdsw="urn:ietf:params:wsdl:ns:esds-1.0"
   C:  xmlns:esds="urn:ietf:params:xsd:ns:esds-1.0">
   C:  <SOAP-ENV:Body>
   C:    <esds:EventCreate
   C:      xsi:type="esds:EventCreateIn">
   C:      <sid
   C:        xsi:type="esds:tSessionID">
   C:        41xM1R6VD66l5Jb1HO8462Q7hWgDtWr4  </sid>
   C:      <extension
   C:        xsi:type="esds:tExtension">
   C:      </extension>
   C:      <event
   C:        xsi:type="esds:tEventTypeChoice">
   C:        <voidEvent
   C:          xsi:type="esds:tVoidEvent">
   C:          <extension
   C:            xsi:type="esds:tExtension">
   C:          </extension>
   C:          <priority
   C:            xsi:type="esds:tEventPriority">
   C:            1  </priority>
   C:          <ttl
   C:            xsi:type="esds:tEventTTL">
   C:            36000  </ttl>
   C:          <eventID
   C:            xsi:type="esds:tEventID">
   C:            123456  </eventID>
   C:        </voidEvent>
   C:        <objectEvent
   C:          xsi:type="esds:tObjectEvent">
   C:          <extension
   C:            xsi:type="esds:tExtension">
   C:          </extension>
   C:          <priority
   C:            xsi:type="esds:tEventPriority">
   C:            1  </priority>



Thompson                 Expires April 19, 2008                [Page 23]

Internet-Draft                ESDS Commands                 October 2007


   C:          <ttl
   C:            xsi:type="esds:tEventTTL">
   C:            36000  </ttl>
   C:          <objectID
   C:            xsi:type="esds:tObjectID">
   C:            urn:epc:id:sgtin:1000.2000.101  </objectID>
   C:          <lifeCycleStepID
   C:            xsi:type="esds:tLifeCycleStepID">
   C:            arrive  </lifeCycleStepID>
   C:          <eventClass
   C:            xsi:type="esds:tEventClass">
   C:            C1  </eventClass>
   C:          <sourceTS
   C:            xsi:type="xs:dateTime">
   C:            2007-12-01T00:00:01.123Z  </sourceTS>
   C:          <serviceList
   C:            xsi:type="esds:tServiceIDList"
   C:            action="replace ">
   C:            <id
   C:              xsi:type="esds:tServiceID">
   C:              id1  </id>
   C:          </serviceList>
   C:          <messageDigest
   C:            xsi:type="esds:tMessageDigest"
   C:            alg="sha1  ">
   C:            <digest
   C:              xsi:type="tMessageDigestHexString">
   C:              5baa61e4c9b93f3f0682250b6cf8331b7ee68fd8  </digest>
   C:          </messageDigest>
   C:        </objectEvent>
   C:      </event>
   C:      <supplyChainID
   C:        xsi:type="esds:tSupplyChainID">
   C:        SC001 </supplyChainID>
   C:      <proxyPartnerID
   C:        xsi:type="esds:tPartnerID">
   C:        P001  </proxyPartnerID>
   C:    </esds:EventCreate>
   C:  </SOAP-ENV:Body>
   C:</SOAP-ENV:Envelope>


4.4.2.  Response

   o  Description:

      When an <EventCreate> operation has been processed successfully, a
      server will respond with an <EventCreateResult>.



Thompson                 Expires April 19, 2008                [Page 24]

Internet-Draft                ESDS Commands                 October 2007


   o  Elements:

      *  <result>

         +  Desc: result structure common for each response

         +  Type: tResult

         +  Use: required

      *  <extension>

         +  Desc: user defined extension xml

         +  Type: tExtension

         +  Use: optional, but no more than 1 occurrence(s)

      *  <eventID>

         +  Desc: event identifier

         +  Type: tEventID

         +  Use: required


























Thompson                 Expires April 19, 2008                [Page 25]

Internet-Draft                ESDS Commands                 October 2007


   S:<?xml version="1.0" encoding="utf-8"?>
   S:<SOAP-ENV:Envelope
   S:  xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
   S:  xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
   S:  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
   S:  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
   S:  xmlns:esdsw="urn:ietf:params:wsdl:ns:esds-1.0"
   S:  xmlns:esds="urn:ietf:params:xsd:ns:esds-1.0">
   S:  <SOAP-ENV:Body>
   S:    <esds:EventCreateResult
   S:      xsi:type="esds:EventCreateOut">
   S:      <result
   S:        xsi:type="esds:tResult"
   S:        code="1000  "
   S:        desc="COMMAND_COMPLETED_SUCCESSFULLY   ">
   S:        <value
   S:          xsi:type="xs:string">
   S:          value1  </value>
   S:      </result>
   S:      <extension
   S:        xsi:type="esds:tExtension">
   S:      </extension>
   S:      <eventID
   S:        xsi:type="esds:tEventID">
   S:        123456  </eventID>
   S:    </esds:EventCreateResult>
   S:  </SOAP-ENV:Body>
   S:</SOAP-ENV:Envelope>


4.5.  <EventInfo>

4.5.1.  Request

   o  Description:

      The ESDS <EventInfo> operation is used to query the details of an
      individual <Event> in the ESDS.  The event to be queried is
      located by the unique <eventID> assigned to each and every event
      in the system.

   o  Elements:

      *  <sid>

         +  Desc: session identifier





Thompson                 Expires April 19, 2008                [Page 26]

Internet-Draft                ESDS Commands                 October 2007


         +  Type: tSessionID

         +  Use: required

      *  <extension>

         +  Desc: user defined extension xml

         +  Type: tExtension

         +  Use: optional, but no more than 1 occurrence(s)

      *  <eventID>

         +  Desc: event identifier

         +  Type: tEventID

         +  Use: required



   C:<?xml version="1.0" encoding="utf-8"?>
   C:<SOAP-ENV:Envelope
   C:  xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
   C:  xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
   C:  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
   C:  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
   C:  xmlns:esdsw="urn:ietf:params:wsdl:ns:esds-1.0"
   C:  xmlns:esds="urn:ietf:params:xsd:ns:esds-1.0">
   C:  <SOAP-ENV:Body>
   C:    <esds:EventInfo
   C:      xsi:type="esds:EventInfoIn">
   C:      <sid
   C:        xsi:type="esds:tSessionID">
   C:        41xM1R6VD66l5Jb1HO8462Q7hWgDtWr4  </sid>
   C:      <extension
   C:        xsi:type="esds:tExtension">
   C:      </extension>
   C:      <eventID
   C:        xsi:type="esds:tEventID">
   C:        123456  </eventID>
   C:    </esds:EventInfo>
   C:  </SOAP-ENV:Body>
   C:</SOAP-ENV:Envelope>






Thompson                 Expires April 19, 2008                [Page 27]

Internet-Draft                ESDS Commands                 October 2007


4.5.2.  Response

   o  Description:

      When a <EventInfo> operation has been processed successfully, a
      server will respond with an <EventInfoResult>.

   o  Elements:

      *  <result>

         +  Desc: result structure common for each response

         +  Type: tResult

         +  Use: required

      *  <extension>

         +  Desc: user defined extension xml

         +  Type: tExtension

         +  Use: optional, but no more than 1 occurrence(s)

      *  <event>

         +  Desc: event one of (object or void)

         +  Type: tInfoEvent

         +  Use: required



   S:<?xml version="1.0" encoding="utf-8"?>
   S:<SOAP-ENV:Envelope
   S:  xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
   S:  xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
   S:  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
   S:  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
   S:  xmlns:esdsw="urn:ietf:params:wsdl:ns:esds-1.0"
   S:  xmlns:esds="urn:ietf:params:xsd:ns:esds-1.0">
   S:  <SOAP-ENV:Body>
   S:    <esds:EventInfoResult
   S:      xsi:type="esds:EventInfoOut">
   S:      <result
   S:        xsi:type="esds:tResult"



Thompson                 Expires April 19, 2008                [Page 28]

Internet-Draft                ESDS Commands                 October 2007


   S:        code="1000  "
   S:        desc="COMMAND_COMPLETED_SUCCESSFULLY   ">
   S:        <value
   S:          xsi:type="xs:string">
   S:          value1  </value>
   S:      </result>
   S:      <extension
   S:        xsi:type="esds:tExtension">
   S:      </extension>
   S:      <event
   S:        xsi:type="esds:tInfoEvent">
   S:        <eventID
   S:          xsi:type="esds:tEventID">
   S:          123456  </eventID>
   S:        <objectID
   S:          xsi:type="esds:tObjectID">
   S:          urn:epc:id:sgtin:1000.2000.101  </objectID>
   S:        <eventType
   S:          xsi:type="esds:tEventType">
   S:          object  </eventType>
   S:        <eventClass
   S:          xsi:type="esds:tEventClass">
   S:          C1  </eventClass>
   S:        <lifeCycleStepID
   S:          xsi:type="esds:tLifeCycleStepID">
   S:          arrive  </lifeCycleStepID>
   S:        <eventTS
   S:          xsi:type="xs:dateTime">
   S:          2006-12-01T12:12:12.123Z  </eventTS>
   S:        <sourceTS
   S:          xsi:type="xs:dateTime">
   S:          2007-12-01T00:00:01.123Z  </sourceTS>
   S:        <partnerID
   S:          xsi:type="esds:tPartnerID">
   S:          P001  </partnerID>
   S:        <supplyChainID
   S:          xsi:type="esds:tSupplyChainID">
   S:          SC001 </supplyChainID>
   S:        <userID
   S:          xsi:type="esds:tUserID">
   S:          U001  </userID>
   S:        <serviceList
   S:          xsi:type="esds:tServiceItemList"
   S:          action="replace ">
   S:          <service
   S:            xsi:type="esds:tServiceItem"
   S:            id="urn1  "
   S:            type="ds  "



Thompson                 Expires April 19, 2008                [Page 29]

Internet-Draft                ESDS Commands                 October 2007


   S:            uri="https://www.example.com/esds  ">
   S:          </service>
   S:        </serviceList>
   S:        <messageDigest
   S:          xsi:type="esds:tMessageDigest"
   S:          alg="sha1  ">
   S:          <digest
   S:            xsi:type="tMessageDigestHexString">
   S:            5baa61e4c9b93f3f0682250b6cf8331b7ee68fd8  </digest>
   S:        </messageDigest>
   S:        <priority
   S:          xsi:type="esds:tEventPriority">
   S:          1  </priority>
   S:        <ttl
   S:          xsi:type="esds:tEventTTL">
   S:          36000  </ttl>
   S:      </event>
   S:    </esds:EventInfoResult>
   S:  </SOAP-ENV:Body>
   S:</SOAP-ENV:Envelope>


4.6.  <EventLookup>

4.6.1.  Request

   o  Description:

      The ESDS <EventLookup> operation is used to query a sequence of
      events from the ESDS given the request parameter criteria elements
      below.  The results returned will be the set of events posted
      within the search criteria, excluding the events that were marked
      as void with a <voidEvent>.  This operation is the primary query
      interface to the ESDS and can return immediate results if
      <subscribe> is set to "false" or not set at all.  If <subscribe>
      is set to "true" then the <EventLookup> request will be queued and
      the results will be requested asynchronously and stored in your
      parter result queue.  The result queue will have a quota limit and
      results can be pulled from the result queue using the <EventFetch>
      operation.

   o  Elements:

      *  <sid>

         +  Desc: session identifier





Thompson                 Expires April 19, 2008                [Page 30]

Internet-Draft                ESDS Commands                 October 2007


         +  Type: tSessionID

         +  Use: required

      *  <extension>

         +  Desc: user defined extension xml

         +  Type: tExtension

         +  Use: optional, but no more than 1 occurrence(s)

      *  <objectID>

         +  Desc: object identifier

         +  Type: tObjectID

         +  Use: required

      *  <lifeCycleStepID>

         +  Desc: life cycle step identifier

         +  Type: tLifeCycleStepID

         +  Use: optional, but no more than 1 occurrence(s)

      *  <startingAt>

         +  Desc: starting timestamp range inclusive

         +  Type: xs:dateTime

         +  Use: optional, but no more than 1 occurrence(s)

      *  <endingAt>

         +  Desc: ending timestamp range inclusive

         +  Type: xs:dateTime

         +  Use: optional, but no more than 1 occurrence(s)








Thompson                 Expires April 19, 2008                [Page 31]

Internet-Draft                ESDS Commands                 October 2007


   C:<?xml version="1.0" encoding="utf-8"?>
   C:<SOAP-ENV:Envelope
   C:  xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
   C:  xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
   C:  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
   C:  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
   C:  xmlns:esdsw="urn:ietf:params:wsdl:ns:esds-1.0"
   C:  xmlns:esds="urn:ietf:params:xsd:ns:esds-1.0">
   C:  <SOAP-ENV:Body>
   C:    <esds:EventLookup
   C:      xsi:type="esds:EventLookupIn">
   C:      <sid
   C:        xsi:type="esds:tSessionID">
   C:        41xM1R6VD66l5Jb1HO8462Q7hWgDtWr4  </sid>
   C:      <extension
   C:        xsi:type="esds:tExtension">
   C:      </extension>
   C:      <objectID
   C:        xsi:type="esds:tObjectID">
   C:        urn:epc:id:sgtin:1000.2000.101  </objectID>
   C:      <lifeCycleStepID
   C:        xsi:type="esds:tLifeCycleStepID">
   C:        arrive  </lifeCycleStepID>
   C:      <startingAt
   C:        xsi:type="xs:dateTime">
   C:        2006-12-01T00:00:01.123Z  </startingAt>
   C:      <endingAt
   C:        xsi:type="xs:dateTime">
   C:        2007-12-01T00:00:01.123Z  </endingAt>
   C:    </esds:EventLookup>
   C:  </SOAP-ENV:Body>
   C:</SOAP-ENV:Envelope>


4.6.2.  Response

   o  Description:

      When a <EventLookup> operation has been processed successfully, a
      server will respond with an <EventLookupResult>.

   o  Elements:

      *  <result>

         +  Desc: result structure common for each response





Thompson                 Expires April 19, 2008                [Page 32]

Internet-Draft                ESDS Commands                 October 2007


         +  Type: tResult

         +  Use: required

      *  <extension>

         +  Desc: user defined extension xml

         +  Type: tExtension

         +  Use: optional, but no more than 1 occurrence(s)

      *  <eventList>

         +  Desc: list of events

         +  Type: tEventItemList

         +  Use: required



   S:<?xml version="1.0" encoding="utf-8"?>
   S:<SOAP-ENV:Envelope
   S:  xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
   S:  xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
   S:  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
   S:  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
   S:  xmlns:esdsw="urn:ietf:params:wsdl:ns:esds-1.0"
   S:  xmlns:esds="urn:ietf:params:xsd:ns:esds-1.0">
   S:  <SOAP-ENV:Body>
   S:    <esds:EventLookupResult
   S:      xsi:type="esds:EventLookupOut">
   S:      <result
   S:        xsi:type="esds:tResult"
   S:        code="1000  "
   S:        desc="COMMAND_COMPLETED_SUCCESSFULLY   ">
   S:        <value
   S:          xsi:type="xs:string">
   S:          value1  </value>
   S:      </result>
   S:      <extension
   S:        xsi:type="esds:tExtension">
   S:      </extension>
   S:      <eventList
   S:        xsi:type="esds:tEventItemList"
   S:        action="add  ">
   S:        <event



Thompson                 Expires April 19, 2008                [Page 33]

Internet-Draft                ESDS Commands                 October 2007


   S:          xsi:type="esds:tEventItem"
   S:          e="123456789  "
   S:          o="urn:epc:id:sgtin:1000.2000.101  "
   S:          t="object  "
   S:          c="C1  "
   S:          lcs="urn:ietf:aero:baggage:create  "
   S:          ets="2006-12-01T00:00:01.123Z  "
   S:          sts="2007-12-01T00:00:01.123Z  "
   S:          u="U001  "
   S:          p="P001  "
   S:          sc="SC001  ">
   S:          <serviceList
   S:            xsi:type="esds:tServiceItemList"
   S:            action="replace ">
   S:            <service
   S:              xsi:type="esds:tServiceItem"
   S:              id="urn1  "
   S:              type="ds  "
   S:              uri="https://www.example.com/esds  ">
   S:            </service>
   S:          </serviceList>
   S:        </event>
   S:      </eventList>
   S:    </esds:EventLookupResult>
   S:  </SOAP-ENV:Body>
   S:</SOAP-ENV:Envelope>

























Thompson                 Expires April 19, 2008                [Page 34]

Internet-Draft                ESDS Commands                 October 2007


5.  Support Object Commands

5.1.  <Lookup>

5.1.1.  Request

   o  Description:

      The ESDS <Lookup> operation is used to lookup common static table
      entries used by clients.

   o  Elements:

      *  <sid>

         +  Desc: session identifier

         +  Type: tSessionID

         +  Use: required

      *  <extension>

         +  Desc: user defined extension xml

         +  Type: tExtension

         +  Use: optional, but no more than 1 occurrence(s)

      *  <tableID>

         +  Desc: table identifier

         +  Type: tTableID

         +  Use: required















Thompson                 Expires April 19, 2008                [Page 35]

Internet-Draft                ESDS Commands                 October 2007


   C:<?xml version="1.0" encoding="utf-8"?>
   C:<SOAP-ENV:Envelope
   C:  xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
   C:  xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
   C:  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
   C:  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
   C:  xmlns:esdsw="urn:ietf:params:wsdl:ns:esds-1.0"
   C:  xmlns:esds="urn:ietf:params:xsd:ns:esds-1.0">
   C:  <SOAP-ENV:Body>
   C:    <esds:Lookup
   C:      xsi:type="esds:LookupIn">
   C:      <sid
   C:        xsi:type="esds:tSessionID">
   C:        41xM1R6VD66l5Jb1HO8462Q7hWgDtWr4  </sid>
   C:      <extension
   C:        xsi:type="esds:tExtension">
   C:      </extension>
   C:      <tableID
   C:        xsi:type="esds:tTableID">
   C:        mytable  </tableID>
   C:    </esds:Lookup>
   C:  </SOAP-ENV:Body>
   C:</SOAP-ENV:Envelope>


5.1.2.  Response

   o  Description:

      When a <Lookup> operation has been processed successfully, a
      server will respond with an <LookupResult>.

   o  Elements:

      *  <result>

         +  Desc: result structure common for each response

         +  Type: tResult

         +  Use: required

      *  <extension>

         +  Desc: user defined extension xml

         +  Type: tExtension




Thompson                 Expires April 19, 2008                [Page 36]

Internet-Draft                ESDS Commands                 October 2007


         +  Use: optional, but no more than 1 occurrence(s)

      *  <rowList>

         +  Desc: list of rows

         +  Type: tTableRowItemList

         +  Use: required



   S:<?xml version="1.0" encoding="utf-8"?>
   S:<SOAP-ENV:Envelope
   S:  xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
   S:  xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
   S:  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
   S:  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
   S:  xmlns:esdsw="urn:ietf:params:wsdl:ns:esds-1.0"
   S:  xmlns:esds="urn:ietf:params:xsd:ns:esds-1.0">
   S:  <SOAP-ENV:Body>
   S:    <esds:LookupResult
   S:      xsi:type="esds:LookupOut">
   S:      <result
   S:        xsi:type="esds:tResult"
   S:        code="1000  "
   S:        desc="COMMAND_COMPLETED_SUCCESSFULLY   ">
   S:        <value
   S:          xsi:type="xs:string">
   S:          value1  </value>
   S:      </result>
   S:      <extension
   S:        xsi:type="esds:tExtension">
   S:      </extension>
   S:      <rowList
   S:        xsi:type="esds:tTableRowItemList"
   S:        action="replace  ">
   S:        <row
   S:          xsi:type="esds:tTableRowItem"
   S:          uid="100  "
   S:          id="active  "
   S:          desc="Active Status  ">
   S:        </row>
   S:      </rowList>
   S:    </esds:LookupResult>
   S:  </SOAP-ENV:Body>
   S:</SOAP-ENV:Envelope>




Thompson                 Expires April 19, 2008                [Page 37]

Internet-Draft                ESDS Commands                 October 2007


5.2.  <RoleCreate>

5.2.1.  Request

   o  Description:

      The ESDS <RoleCreate> operation is used to create <Role>s in the
      ESDS system.

   o  Elements:

      *  <sid>

         +  Desc: session identifier

         +  Type: tSessionID

         +  Use: required

      *  <extension>

         +  Desc: user defined extension xml

         +  Type: tExtension

         +  Use: optional, but no more than 1 occurrence(s)

      *  <roleID>

         +  Desc: role identifier

         +  Type: tRoleID

         +  Use: required

      *  <grantList>

         +  Desc: list of grants (object,method,permission)

         +  Type: tGrantItemList

         +  Use: optional, but no more than 1 occurrence(s)









Thompson                 Expires April 19, 2008                [Page 38]

Internet-Draft                ESDS Commands                 October 2007


   C:<?xml version="1.0" encoding="utf-8"?>
   C:<SOAP-ENV:Envelope
   C:  xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
   C:  xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
   C:  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
   C:  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
   C:  xmlns:esdsw="urn:ietf:params:wsdl:ns:esds-1.0"
   C:  xmlns:esds="urn:ietf:params:xsd:ns:esds-1.0">
   C:  <SOAP-ENV:Body>
   C:    <esds:RoleCreate
   C:      xsi:type="esds:RoleCreateIn">
   C:      <sid
   C:        xsi:type="esds:tSessionID">
   C:        41xM1R6VD66l5Jb1HO8462Q7hWgDtWr4  </sid>
   C:      <extension
   C:        xsi:type="esds:tExtension">
   C:      </extension>
   C:      <roleID
   C:        xsi:type="esds:tRoleID">
   C:        default  </roleID>
   C:      <grantList
   C:        xsi:type="esds:tGrantItemList"
   C:        action="replace  ">
   C:        <grant
   C:          xsi:type="esds:tGrantItem"
   C:          o="event  "
   C:          m="create  "
   C:          p="execute  ">
   C:        </grant>
   C:      </grantList>
   C:    </esds:RoleCreate>
   C:  </SOAP-ENV:Body>
   C:</SOAP-ENV:Envelope>


5.2.2.  Response

   o  Description:

      When a <RoleCreate> operation has been processed successfully, a
      server will respond with an <RoleCreateResult>.

   o  Elements:

      *  <result>

         +  Desc: result structure common for each response




Thompson                 Expires April 19, 2008                [Page 39]

Internet-Draft                ESDS Commands                 October 2007


         +  Type: tResult

         +  Use: required

      *  <extension>

         +  Desc: user defined extension xml

         +  Type: tExtension

         +  Use: optional, but no more than 1 occurrence(s)

      *  <roleUID>

         +  Desc: role unique identifier

         +  Type: tSmallUID

         +  Use: required



   S:<?xml version="1.0" encoding="utf-8"?>
   S:<SOAP-ENV:Envelope
   S:  xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
   S:  xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
   S:  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
   S:  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
   S:  xmlns:esdsw="urn:ietf:params:wsdl:ns:esds-1.0"
   S:  xmlns:esds="urn:ietf:params:xsd:ns:esds-1.0">
   S:  <SOAP-ENV:Body>
   S:    <esds:RoleCreateResult
   S:      xsi:type="esds:RoleCreateOut">
   S:      <result
   S:        xsi:type="esds:tResult"
   S:        code="1000  "
   S:        desc="COMMAND_COMPLETED_SUCCESSFULLY   ">
   S:        <value
   S:          xsi:type="xs:string">
   S:          value1  </value>
   S:      </result>
   S:      <extension
   S:        xsi:type="esds:tExtension">
   S:      </extension>
   S:      <roleUID
   S:        xsi:type="esds:tSmallUID">
   S:        101  </roleUID>
   S:    </esds:RoleCreateResult>



Thompson                 Expires April 19, 2008                [Page 40]

Internet-Draft                ESDS Commands                 October 2007


   S:  </SOAP-ENV:Body>
   S:</SOAP-ENV:Envelope>


5.3.  <RoleInfo>

5.3.1.  Request

   o  Description:

      The ESDS <RoleInfo> operation is used to query the details of an
      individual <Role> in the ESDS.  The <Role> to be queried is
      located by the unique <roleID> used to create the <Role> in the
      system.

   o  Elements:

      *  <sid>

         +  Desc: session identifier

         +  Type: tSessionID

         +  Use: required

      *  <extension>

         +  Desc: user defined extension xml

         +  Type: tExtension

         +  Use: optional, but no more than 1 occurrence(s)

      *  <roleID>

         +  Desc: role identifier

         +  Type: tRoleID

         +  Use: required











Thompson                 Expires April 19, 2008                [Page 41]

Internet-Draft                ESDS Commands                 October 2007


   C:<?xml version="1.0" encoding="utf-8"?>
   C:<SOAP-ENV:Envelope
   C:  xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
   C:  xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
   C:  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
   C:  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
   C:  xmlns:esdsw="urn:ietf:params:wsdl:ns:esds-1.0"
   C:  xmlns:esds="urn:ietf:params:xsd:ns:esds-1.0">
   C:  <SOAP-ENV:Body>
   C:    <esds:RoleInfo
   C:      xsi:type="esds:RoleInfoIn">
   C:      <sid
   C:        xsi:type="esds:tSessionID">
   C:        41xM1R6VD66l5Jb1HO8462Q7hWgDtWr4  </sid>
   C:      <extension
   C:        xsi:type="esds:tExtension">
   C:      </extension>
   C:      <roleID
   C:        xsi:type="esds:tRoleID">
   C:        default  </roleID>
   C:    </esds:RoleInfo>
   C:  </SOAP-ENV:Body>
   C:</SOAP-ENV:Envelope>


5.3.2.  Response

   o  Description:

      When a <RoleInfo> operation has been processed successfully, a
      server will respond with an <RoleInfoResult>.

   o  Elements:

      *  <result>

         +  Desc: result structure common for each response

         +  Type: tResult

         +  Use: required

      *  <extension>

         +  Desc: user defined extension xml

         +  Type: tExtension




Thompson                 Expires April 19, 2008                [Page 42]

Internet-Draft                ESDS Commands                 October 2007


         +  Use: optional, but no more than 1 occurrence(s)

      *  <roleUID>

         +  Desc: role unique identifier

         +  Type: tSmallUID

         +  Use: required

      *  <roleID>

         +  Desc: role identifier

         +  Type: tRoleID

         +  Use: required

      *  <grantList>

         +  Desc: list of grants (object,method,permission)

         +  Type: tGrantItemList

         +  Use: optional, but no more than 1 occurrence(s)


























Thompson                 Expires April 19, 2008                [Page 43]

Internet-Draft                ESDS Commands                 October 2007


   S:<?xml version="1.0" encoding="utf-8"?>
   S:<SOAP-ENV:Envelope
   S:  xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
   S:  xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
   S:  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
   S:  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
   S:  xmlns:esdsw="urn:ietf:params:wsdl:ns:esds-1.0"
   S:  xmlns:esds="urn:ietf:params:xsd:ns:esds-1.0">
   S:  <SOAP-ENV:Body>
   S:    <esds:RoleInfoResult
   S:      xsi:type="esds:RoleInfoOut">
   S:      <result
   S:        xsi:type="esds:tResult"
   S:        code="1000  "
   S:        desc="COMMAND_COMPLETED_SUCCESSFULLY   ">
   S:        <value
   S:          xsi:type="xs:string">
   S:          value1  </value>
   S:      </result>
   S:      <extension
   S:        xsi:type="esds:tExtension">
   S:      </extension>
   S:      <roleUID
   S:        xsi:type="esds:tSmallUID">
   S:        101  </roleUID>
   S:      <roleID
   S:        xsi:type="esds:tRoleID">
   S:        default  </roleID>
   S:      <grantList
   S:        xsi:type="esds:tGrantItemList"
   S:        action="replace  ">
   S:        <grant
   S:          xsi:type="esds:tGrantItem"
   S:          o="event  "
   S:          m="create  "
   S:          p="execute  ">
   S:        </grant>
   S:      </grantList>
   S:    </esds:RoleInfoResult>
   S:  </SOAP-ENV:Body>
   S:</SOAP-ENV:Envelope>


5.4.  <RoleUpdate>







Thompson                 Expires April 19, 2008                [Page 44]

Internet-Draft                ESDS Commands                 October 2007


5.4.1.  Request

   o  Description:

      The ESDS <RoleUpdate> operation is used to modify the contents of
      the specified <Role>.

   o  Elements:

      *  <sid>

         +  Desc: session identifier

         +  Type: tSessionID

         +  Use: required

      *  <extension>

         +  Desc: user defined extension xml

         +  Type: tExtension

         +  Use: optional, but no more than 1 occurrence(s)

      *  <roleUID>

         +  Desc: role unique identifier

         +  Type: tSmallUID

         +  Use: required

      *  <roleID>

         +  Desc: role identifier

         +  Type: tRoleID

         +  Use: optional, but no more than 1 occurrence(s)

      *  <grantList>

         +  Desc: list of grants (object,method,permission)

         +  Type: tGrantItemList





Thompson                 Expires April 19, 2008                [Page 45]

Internet-Draft                ESDS Commands                 October 2007


         +  Use: optional, but no more than 1 occurrence(s)



   C:<?xml version="1.0" encoding="utf-8"?>
   C:<SOAP-ENV:Envelope
   C:  xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
   C:  xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
   C:  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
   C:  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
   C:  xmlns:esdsw="urn:ietf:params:wsdl:ns:esds-1.0"
   C:  xmlns:esds="urn:ietf:params:xsd:ns:esds-1.0">
   C:  <SOAP-ENV:Body>
   C:    <esds:RoleUpdate
   C:      xsi:type="esds:RoleUpdateIn">
   C:      <sid
   C:        xsi:type="esds:tSessionID">
   C:        41xM1R6VD66l5Jb1HO8462Q7hWgDtWr4  </sid>
   C:      <extension
   C:        xsi:type="esds:tExtension">
   C:      </extension>
   C:      <roleUID
   C:        xsi:type="esds:tSmallUID">
   C:        101  </roleUID>
   C:      <roleID
   C:        xsi:type="esds:tRoleID">
   C:        default  </roleID>
   C:      <grantList
   C:        xsi:type="esds:tGrantItemList"
   C:        action="replace  ">
   C:        <grant
   C:          xsi:type="esds:tGrantItem"
   C:          o="event  "
   C:          m="create  "
   C:          p="execute  ">
   C:        </grant>
   C:      </grantList>
   C:    </esds:RoleUpdate>
   C:  </SOAP-ENV:Body>
   C:</SOAP-ENV:Envelope>


5.4.2.  Response

   o  Description:

      When a <RoleUpdate> operation has been processed successfully, a
      server will respond with an <RoleUpdateResult>.



Thompson                 Expires April 19, 2008                [Page 46]

Internet-Draft                ESDS Commands                 October 2007


   o  Elements:

      *  <result>

         +  Desc: result structure common for each response

         +  Type: tResult

         +  Use: required

      *  <extension>

         +  Desc: user defined extension xml

         +  Type: tExtension

         +  Use: optional, but no more than 1 occurrence(s)



   S:<?xml version="1.0" encoding="utf-8"?>
   S:<SOAP-ENV:Envelope
   S:  xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
   S:  xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
   S:  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
   S:  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
   S:  xmlns:esdsw="urn:ietf:params:wsdl:ns:esds-1.0"
   S:  xmlns:esds="urn:ietf:params:xsd:ns:esds-1.0">
   S:  <SOAP-ENV:Body>
   S:    <esds:RoleUpdateResult
   S:      xsi:type="esds:RoleUpdateOut">
   S:      <result
   S:        xsi:type="esds:tResult"
   S:        code="1000  "
   S:        desc="COMMAND_COMPLETED_SUCCESSFULLY   ">
   S:        <value
   S:          xsi:type="xs:string">
   S:          value1  </value>
   S:      </result>
   S:      <extension
   S:        xsi:type="esds:tExtension">
   S:      </extension>
   S:    </esds:RoleUpdateResult>
   S:  </SOAP-ENV:Body>
   S:</SOAP-ENV:Envelope>






Thompson                 Expires April 19, 2008                [Page 47]

Internet-Draft                ESDS Commands                 October 2007


5.5.  <RoleDelete>

5.5.1.  Request

   o  Description:

      The ESDS <RoleDelete> operation is used to remove a <Role> from
      the ESDS system.  If the <Role> is associated with other objects
      within the ESDS, then the <Role> will be marked with an "inactive"
      state.

   o  Elements:

      *  <sid>

         +  Desc: session identifier

         +  Type: tSessionID

         +  Use: required

      *  <extension>

         +  Desc: user defined extension xml

         +  Type: tExtension

         +  Use: optional, but no more than 1 occurrence(s)

      *  <roleID>

         +  Desc: role identifier

         +  Type: tRoleID

         +  Use: required















Thompson                 Expires April 19, 2008                [Page 48]

Internet-Draft                ESDS Commands                 October 2007


   C:<?xml version="1.0" encoding="utf-8"?>
   C:<SOAP-ENV:Envelope
   C:  xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
   C:  xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
   C:  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
   C:  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
   C:  xmlns:esdsw="urn:ietf:params:wsdl:ns:esds-1.0"
   C:  xmlns:esds="urn:ietf:params:xsd:ns:esds-1.0">
   C:  <SOAP-ENV:Body>
   C:    <esds:RoleDelete
   C:      xsi:type="esds:RoleDeleteIn">
   C:      <sid
   C:        xsi:type="esds:tSessionID">
   C:        41xM1R6VD66l5Jb1HO8462Q7hWgDtWr4  </sid>
   C:      <extension
   C:        xsi:type="esds:tExtension">
   C:      </extension>
   C:      <roleID
   C:        xsi:type="esds:tRoleID">
   C:        default  </roleID>
   C:    </esds:RoleDelete>
   C:  </SOAP-ENV:Body>
   C:</SOAP-ENV:Envelope>


5.5.2.  Response

   o  Description:

      When a <RoleDelete> operation has been processed successfully, a
      server will respond with an <RoleDeleteResult>.

   o  Elements:

      *  <result>

         +  Desc: result structure common for each response

         +  Type: tResult

         +  Use: required

      *  <extension>

         +  Desc: user defined extension xml

         +  Type: tExtension




Thompson                 Expires April 19, 2008                [Page 49]

Internet-Draft                ESDS Commands                 October 2007


         +  Use: optional, but no more than 1 occurrence(s)



   S:<?xml version="1.0" encoding="utf-8"?>
   S:<SOAP-ENV:Envelope
   S:  xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
   S:  xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
   S:  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
   S:  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
   S:  xmlns:esdsw="urn:ietf:params:wsdl:ns:esds-1.0"
   S:  xmlns:esds="urn:ietf:params:xsd:ns:esds-1.0">
   S:  <SOAP-ENV:Body>
   S:    <esds:RoleDeleteResult
   S:      xsi:type="esds:RoleDeleteOut">
   S:      <result
   S:        xsi:type="esds:tResult"
   S:        code="1000  "
   S:        desc="COMMAND_COMPLETED_SUCCESSFULLY   ">
   S:        <value
   S:          xsi:type="xs:string">
   S:          value1  </value>
   S:      </result>
   S:      <extension
   S:        xsi:type="esds:tExtension">
   S:      </extension>
   S:    </esds:RoleDeleteResult>
   S:  </SOAP-ENV:Body>
   S:</SOAP-ENV:Envelope>


5.6.  <RoleLookup>

5.6.1.  Request

   o  Description:

      The ESDS <RoleLookup> operation is used to query a set of partners
      that match the search criteria specified as request parameter
      elements.

   o  Elements:

      *  <sid>

         +  Desc: session identifier





Thompson                 Expires April 19, 2008                [Page 50]

Internet-Draft                ESDS Commands                 October 2007


         +  Type: tSessionID

         +  Use: required

      *  <extension>

         +  Desc: user defined extension xml

         +  Type: tExtension

         +  Use: optional, but no more than 1 occurrence(s)

      *  <roleID>

         +  Desc: role identifier

         +  Type: tRoleID

         +  Use: required



   C:<?xml version="1.0" encoding="utf-8"?>
   C:<SOAP-ENV:Envelope
   C:  xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
   C:  xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
   C:  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
   C:  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
   C:  xmlns:esdsw="urn:ietf:params:wsdl:ns:esds-1.0"
   C:  xmlns:esds="urn:ietf:params:xsd:ns:esds-1.0">
   C:  <SOAP-ENV:Body>
   C:    <esds:RoleLookup
   C:      xsi:type="esds:RoleLookupIn">
   C:      <sid
   C:        xsi:type="esds:tSessionID">
   C:        41xM1R6VD66l5Jb1HO8462Q7hWgDtWr4  </sid>
   C:      <extension
   C:        xsi:type="esds:tExtension">
   C:      </extension>
   C:      <roleID
   C:        xsi:type="esds:tRoleID">
   C:        default  </roleID>
   C:    </esds:RoleLookup>
   C:  </SOAP-ENV:Body>
   C:</SOAP-ENV:Envelope>






Thompson                 Expires April 19, 2008                [Page 51]

Internet-Draft                ESDS Commands                 October 2007


5.6.2.  Response

   o  Description:

      When a <RoleLookup> operation has been processed successfully, a
      server will respond with an <RoleLookupResult>.

   o  Elements:

      *  <result>

         +  Desc: result structure common for each response

         +  Type: tResult

         +  Use: required

      *  <extension>

         +  Desc: user defined extension xml

         +  Type: tExtension

         +  Use: optional, but no more than 1 occurrence(s)

      *  <roleList>

         +  Desc: list of roles

         +  Type: tRoleItemList

         +  Use: required



















Thompson                 Expires April 19, 2008                [Page 52]

Internet-Draft                ESDS Commands                 October 2007


   S:<?xml version="1.0" encoding="utf-8"?>
   S:<SOAP-ENV:Envelope
   S:  xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
   S:  xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
   S:  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
   S:  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
   S:  xmlns:esdsw="urn:ietf:params:wsdl:ns:esds-1.0"
   S:  xmlns:esds="urn:ietf:params:xsd:ns:esds-1.0">
   S:  <SOAP-ENV:Body>
   S:    <esds:RoleLookupResult
   S:      xsi:type="esds:RoleLookupOut">
   S:      <result
   S:        xsi:type="esds:tResult"
   S:        code="1000  "
   S:        desc="COMMAND_COMPLETED_SUCCESSFULLY   ">
   S:        <value
   S:          xsi:type="xs:string">
   S:          value1  </value>
   S:      </result>
   S:      <extension
   S:        xsi:type="esds:tExtension">
   S:      </extension>
   S:      <roleList
   S:        xsi:type="esds:tRoleItemList">
   S:        <role
   S:          xsi:type="esds:tRoleItem"
   S:          id="R001  "
   S:          uid="200  ">
   S:        </role>
   S:      </roleList>
   S:    </esds:RoleLookupResult>
   S:  </SOAP-ENV:Body>
   S:</SOAP-ENV:Envelope>


5.7.  <UserCreate>

5.7.1.  Request

   o  Description:

      The ESDS <UserCreate> operation is used to create <User>s in the
      ESDS system.

   o  Elements:

      *  <sid>




Thompson                 Expires April 19, 2008                [Page 53]

Internet-Draft                ESDS Commands                 October 2007


         +  Desc: session identifier

         +  Type: tSessionID

         +  Use: required

      *  <extension>

         +  Desc: user defined extension xml

         +  Type: tExtension

         +  Use: optional, but no more than 1 occurrence(s)

      *  <userID>

         +  Desc: user identifier

         +  Type: tUserID

         +  Use: required

      *  <password>

         +  Desc: password

         +  Type: tPassword

         +  Use: required

      *  <roleID>

         +  Desc: role identifier

         +  Type: tRoleID

         +  Use: required

      *  <partnerID>

         +  Desc: partner identifier

         +  Type: tPartnerID

         +  Use: required






Thompson                 Expires April 19, 2008                [Page 54]

Internet-Draft                ESDS Commands                 October 2007


      *  <loginMode>

         +  Desc: login mode

         +  Type: tLoginMode

         +  Use: required

      *  <sessionLease>

         +  Desc: session lease

         +  Type: tLeaseSeconds

         +  Use: required

      *  <authorizedCertList>

         +  Desc: authorized certificate list

         +  Type: tX509CertItemList

         +  Use: optional, but no more than 1 occurrence(s)

      *  <eventNotifyTopicList>

         +  Desc: event notification topic list

         +  Type: tEventTopicItemList

         +  Use: optional, but no more than 1 occurrence(s)



   C:<?xml version="1.0" encoding="utf-8"?>
   C:<SOAP-ENV:Envelope
   C:  xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
   C:  xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
   C:  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
   C:  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
   C:  xmlns:esdsw="urn:ietf:params:wsdl:ns:esds-1.0"
   C:  xmlns:esds="urn:ietf:params:xsd:ns:esds-1.0">
   C:  <SOAP-ENV:Body>
   C:    <esds:UserCreate
   C:      xsi:type="esds:UserCreateIn">
   C:      <sid
   C:        xsi:type="esds:tSessionID">
   C:        41xM1R6VD66l5Jb1HO8462Q7hWgDtWr4  </sid>



Thompson                 Expires April 19, 2008                [Page 55]

Internet-Draft                ESDS Commands                 October 2007


   C:      <extension
   C:        xsi:type="esds:tExtension">
   C:      </extension>
   C:      <userID
   C:        xsi:type="esds:tUserID">
   C:        U001  </userID>
   C:      <password
   C:        xsi:type="esds:tPassword">
   C:        password  </password>
   C:      <roleID
   C:        xsi:type="esds:tRoleID">
   C:        default  </roleID>
   C:      <partnerID
   C:        xsi:type="esds:tPartnerID">
   C:        P001  </partnerID>
   C:      <loginMode
   C:        xsi:type="esds:tLoginMode">
   C:        key-and-password  </loginMode>
   C:      <sessionLease
   C:        xsi:type="esds:tLeaseSeconds">
   C:        3600  </sessionLease>
   C:      <authorizedCertList
   C:        xsi:type="esds:tX509CertItemList"
   C:        action="replace  ">
   C:        <cert
   C:          xsi:type="esds:tX509CertItem"
   C:          cn="esds@example.com  "
   C:          o="Afilias Limited.  "
   C:          fingerprint="54f1aafb04f119eacfcefcd12b89d1fa3cfcc727  ">
   C:        </cert>
   C:      </authorizedCertList>
   C:      <eventNotifyTopicList
   C:        xsi:type="esds:tEventTopicItemList"
   C:        action="replace  ">
   C:        <eventTopic
   C:          xsi:type="esds:tEventTopicItem"
   C:          id="topic1  "
   C:          objectIDPattern="urn:epc:id:sgtin:1000.2000.*  ">
   C:          <lifeCycleStepList
   C:            xsi:type="esds:tLifeCycleStepItemList"
   C:            action="replace  ">
   C:            <lifeCycleStep
   C:              xsi:type="esds:tLifeCycleStepItem"
   C:              id="urn:ietf:aero:baggage:create  ">
   C:            </lifeCycleStep>
   C:          </lifeCycleStepList>
   C:          <eventClassList
   C:            xsi:type="esds:tEventClassItemList"



Thompson                 Expires April 19, 2008                [Page 56]

Internet-Draft                ESDS Commands                 October 2007


   C:            action="replace  ">
   C:            <eventClass
   C:              xsi:type="esds:tEventClassItem"
   C:              id="C2  ">
   C:            </eventClass>
   C:          </eventClassList>
   C:        </eventTopic>
   C:      </eventNotifyTopicList>
   C:    </esds:UserCreate>
   C:  </SOAP-ENV:Body>
   C:</SOAP-ENV:Envelope>


5.7.2.  Response

   o  Description:

      When a <UserCreate> operation has been processed successfully, a
      server will respond with an <UserCreateResult>.

   o  Elements:

      *  <result>

         +  Desc: result structure common for each response

         +  Type: tResult

         +  Use: required

      *  <extension>

         +  Desc: user defined extension xml

         +  Type: tExtension

         +  Use: optional, but no more than 1 occurrence(s)

      *  <userUID>

         +  Desc: user unique identifier

         +  Type: tSmallUID

         +  Use: required






Thompson                 Expires April 19, 2008                [Page 57]

Internet-Draft                ESDS Commands                 October 2007


   S:<?xml version="1.0" encoding="utf-8"?>
   S:<SOAP-ENV:Envelope
   S:  xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
   S:  xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
   S:  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
   S:  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
   S:  xmlns:esdsw="urn:ietf:params:wsdl:ns:esds-1.0"
   S:  xmlns:esds="urn:ietf:params:xsd:ns:esds-1.0">
   S:  <SOAP-ENV:Body>
   S:    <esds:UserCreateResult
   S:      xsi:type="esds:UserCreateOut">
   S:      <result
   S:        xsi:type="esds:tResult"
   S:        code="1000  "
   S:        desc="COMMAND_COMPLETED_SUCCESSFULLY   ">
   S:        <value
   S:          xsi:type="xs:string">
   S:          value1  </value>
   S:      </result>
   S:      <extension
   S:        xsi:type="esds:tExtension">
   S:      </extension>
   S:      <userUID
   S:        xsi:type="esds:tSmallUID">
   S:        100  </userUID>
   S:    </esds:UserCreateResult>
   S:  </SOAP-ENV:Body>
   S:</SOAP-ENV:Envelope>


5.8.  <UserInfo>

5.8.1.  Request

   o  Description:

      The ESDS <UserCreate> operation is used to create <User>s in the
      ESDS system.

   o  Elements:

      *  <sid>

         +  Desc: session identifier

         +  Type: tSessionID





Thompson                 Expires April 19, 2008                [Page 58]

Internet-Draft                ESDS Commands                 October 2007


         +  Use: required

      *  <extension>

         +  Desc: user defined extension xml

         +  Type: tExtension

         +  Use: optional, but no more than 1 occurrence(s)

      *  <userID>

         +  Desc: user identifier

         +  Type: tUserID

         +  Use: required

      *  <password>

         +  Desc: password

         +  Type: tPassword

         +  Use: required

      *  <roleID>

         +  Desc: role identifier

         +  Type: tRoleID

         +  Use: required

      *  <partnerID>

         +  Desc: partner identifier

         +  Type: tPartnerID

         +  Use: required

      *  <loginMode>

         +  Desc: login mode

         +  Type: tLoginMode




Thompson                 Expires April 19, 2008                [Page 59]

Internet-Draft                ESDS Commands                 October 2007


         +  Use: required

      *  <sessionLease>

         +  Desc: session lease

         +  Type: tLeaseSeconds

         +  Use: required

      *  <authorizedCertList>

         +  Desc: authorized certificate list

         +  Type: tX509CertItemList

         +  Use: optional, but no more than 1 occurrence(s)

      *  <eventNotifyTopicList>

         +  Desc: event notification topic list

         +  Type: tEventTopicItemList

         +  Use: optional, but no more than 1 occurrence(s)


























Thompson                 Expires April 19, 2008                [Page 60]

Internet-Draft                ESDS Commands                 October 2007


   C:<?xml version="1.0" encoding="utf-8"?>
   C:<SOAP-ENV:Envelope
   C:  xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
   C:  xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
   C:  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
   C:  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
   C:  xmlns:esdsw="urn:ietf:params:wsdl:ns:esds-1.0"
   C:  xmlns:esds="urn:ietf:params:xsd:ns:esds-1.0">
   C:  <SOAP-ENV:Body>
   C:    <esds:UserInfo
   C:      xsi:type="esds:UserInfoIn">
   C:      <sid
   C:        xsi:type="esds:tSessionID">
   C:        41xM1R6VD66l5Jb1HO8462Q7hWgDtWr4  </sid>
   C:      <extension
   C:        xsi:type="esds:tExtension">
   C:      </extension>
   C:      <userID
   C:        xsi:type="esds:tUserID">
   C:        U001  </userID>
   C:    </esds:UserInfo>
   C:  </SOAP-ENV:Body>
   C:</SOAP-ENV:Envelope>


5.8.2.  Response

   o  Description:

      When a <UserInfo> operation has been processed successfully, a
      server will respond with an <UserInfoResult>.

   o  Elements:

      *  <result>

         +  Desc: result structure common for each response

         +  Type: tResult

         +  Use: required

      *  <extension>

         +  Desc: user defined extension xml

         +  Type: tExtension




Thompson                 Expires April 19, 2008                [Page 61]

Internet-Draft                ESDS Commands                 October 2007


         +  Use: optional, but no more than 1 occurrence(s)

      *  <userUID>

         +  Desc: user unique identifier

         +  Type: tSmallUID

         +  Use: required

      *  <userID>

         +  Desc: user identifier

         +  Type: tUserID

         +  Use: required

      *  <roleID>

         +  Desc: role identifier

         +  Type: tRoleID

         +  Use: required

      *  <partnerID>

         +  Desc: partner identifier

         +  Type: tPartnerID

         +  Use: required

      *  <loginMode>

         +  Desc: login mode

         +  Type: tLoginMode

         +  Use: required

      *  <sessionLease>

         +  Desc: session lease

         +  Type: tLeaseSeconds




Thompson                 Expires April 19, 2008                [Page 62]

Internet-Draft                ESDS Commands                 October 2007


         +  Use: required

      *  <authorizedCertList>

         +  Desc: authorized certificate list

         +  Type: tX509CertItemList

         +  Use: optional, but no more than 1 occurrence(s)

      *  <eventNotifyTopicList>

         +  Desc: event notification topic list

         +  Type: tEventTopicItemList

         +  Use: optional, but no more than 1 occurrence(s)



   S:<?xml version="1.0" encoding="utf-8"?>
   S:<SOAP-ENV:Envelope
   S:  xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
   S:  xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
   S:  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
   S:  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
   S:  xmlns:esdsw="urn:ietf:params:wsdl:ns:esds-1.0"
   S:  xmlns:esds="urn:ietf:params:xsd:ns:esds-1.0">
   S:  <SOAP-ENV:Body>
   S:    <esds:UserInfoResult
   S:      xsi:type="esds:UserInfoOut">
   S:      <result
   S:        xsi:type="esds:tResult"
   S:        code="1000  "
   S:        desc="COMMAND_COMPLETED_SUCCESSFULLY   ">
   S:        <value
   S:          xsi:type="xs:string">
   S:          value1  </value>
   S:      </result>
   S:      <extension
   S:        xsi:type="esds:tExtension">
   S:      </extension>
   S:      <userUID
   S:        xsi:type="esds:tSmallUID">
   S:        100  </userUID>
   S:      <userID
   S:        xsi:type="esds:tUserID">
   S:        U001  </userID>



Thompson                 Expires April 19, 2008                [Page 63]

Internet-Draft                ESDS Commands                 October 2007


   S:      <roleID
   S:        xsi:type="esds:tRoleID">
   S:        default  </roleID>
   S:      <partnerID
   S:        xsi:type="esds:tPartnerID">
   S:        P001  </partnerID>
   S:      <loginMode
   S:        xsi:type="esds:tLoginMode">
   S:        key-and-password  </loginMode>
   S:      <sessionLease
   S:        xsi:type="esds:tLeaseSeconds">
   S:        3600  </sessionLease>
   S:      <authorizedCertList
   S:        xsi:type="esds:tX509CertItemList"
   S:        action="replace  ">
   S:        <cert
   S:          xsi:type="esds:tX509CertItem"
   S:          cn="esds@example.com  "
   S:          o="Afilias Limited.  "
   S:          fingerprint="54f1aafb04f119eacfcefcd12b89d1fa3cfcc727  ">
   S:        </cert>
   S:      </authorizedCertList>
   S:      <eventNotifyTopicList
   S:        xsi:type="esds:tEventTopicItemList"
   S:        action="replace  ">
   S:        <eventTopic
   S:          xsi:type="esds:tEventTopicItem"
   S:          id="topic1  "
   S:          objectIDPattern="urn:epc:id:sgtin:1000.2000.*  ">
   S:          <lifeCycleStepList
   S:            xsi:type="esds:tLifeCycleStepItemList"
   S:            action="replace  ">
   S:            <lifeCycleStep
   S:              xsi:type="esds:tLifeCycleStepItem"
   S:              id="urn:ietf:aero:baggage:create  ">
   S:            </lifeCycleStep>
   S:          </lifeCycleStepList>
   S:          <eventClassList
   S:            xsi:type="esds:tEventClassItemList"
   S:            action="replace  ">
   S:            <eventClass
   S:              xsi:type="esds:tEventClassItem"
   S:              id="C2  ">
   S:            </eventClass>
   S:          </eventClassList>
   S:        </eventTopic>
   S:      </eventNotifyTopicList>
   S:    </esds:UserInfoResult>



Thompson                 Expires April 19, 2008                [Page 64]

Internet-Draft                ESDS Commands                 October 2007


   S:  </SOAP-ENV:Body>
   S:</SOAP-ENV:Envelope>


5.9.  <UserUpdate>

5.9.1.  Request

   o  Description:

      The ESDS <UserUpdate> operation is used to modify the contents of
      the specified <User>.

   o  Elements:

      *  <sid>

         +  Desc: session identifier

         +  Type: tSessionID

         +  Use: required

      *  <extension>

         +  Desc: user defined extension xml

         +  Type: tExtension

         +  Use: optional, but no more than 1 occurrence(s)

      *  <userUID>

         +  Desc: user unique identifier

         +  Type: tSmallUID

         +  Use: required

      *  <userID>

         +  Desc: user identifier

         +  Type: tUserID

         +  Use: optional, but no more than 1 occurrence(s)





Thompson                 Expires April 19, 2008                [Page 65]

Internet-Draft                ESDS Commands                 October 2007


      *  <password>

         +  Desc: password

         +  Type: tPassword

         +  Use: optional, but no more than 1 occurrence(s)

      *  <roleID>

         +  Desc: role identifier

         +  Type: tRoleID

         +  Use: optional, but no more than 1 occurrence(s)

      *  <partnerID>

         +  Desc: partner identifier

         +  Type: tPartnerID

         +  Use: optional, but no more than 1 occurrence(s)

      *  <loginMode>

         +  Desc: login mode

         +  Type: tLoginMode

         +  Use: optional, but no more than 1 occurrence(s)

      *  <sessionLease>

         +  Desc: session lease

         +  Type: tLeaseSeconds

         +  Use: optional, but no more than 1 occurrence(s)

      *  <authorizedCertList>

         +  Desc: authorized certificate list

         +  Type: tX509CertItemList

         +  Use: optional, but no more than 1 occurrence(s)




Thompson                 Expires April 19, 2008                [Page 66]

Internet-Draft                ESDS Commands                 October 2007


      *  <eventNotifyTopicList>

         +  Desc: event notification topic list

         +  Type: tEventTopicItemList

         +  Use: optional, but no more than 1 occurrence(s)



   C:<?xml version="1.0" encoding="utf-8"?>
   C:<SOAP-ENV:Envelope
   C:  xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
   C:  xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
   C:  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
   C:  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
   C:  xmlns:esdsw="urn:ietf:params:wsdl:ns:esds-1.0"
   C:  xmlns:esds="urn:ietf:params:xsd:ns:esds-1.0">
   C:  <SOAP-ENV:Body>
   C:    <esds:UserUpdate
   C:      xsi:type="esds:UserUpdateIn">
   C:      <sid
   C:        xsi:type="esds:tSessionID">
   C:        41xM1R6VD66l5Jb1HO8462Q7hWgDtWr4  </sid>
   C:      <extension
   C:        xsi:type="esds:tExtension">
   C:      </extension>
   C:      <userUID
   C:        xsi:type="esds:tSmallUID">
   C:        100  </userUID>
   C:      <userID
   C:        xsi:type="esds:tUserID">
   C:        U001  </userID>
   C:      <password
   C:        xsi:type="esds:tPassword">
   C:        password  </password>
   C:      <roleID
   C:        xsi:type="esds:tRoleID">
   C:        default  </roleID>
   C:      <partnerID
   C:        xsi:type="esds:tPartnerID">
   C:        P001  </partnerID>
   C:      <loginMode
   C:        xsi:type="esds:tLoginMode">
   C:        key-and-password  </loginMode>
   C:      <sessionLease
   C:        xsi:type="esds:tLeaseSeconds">
   C:        3600  </sessionLease>



Thompson                 Expires April 19, 2008                [Page 67]

Internet-Draft                ESDS Commands                 October 2007


   C:      <authorizedCertList
   C:        xsi:type="esds:tX509CertItemList"
   C:        action="replace  ">
   C:        <cert
   C:          xsi:type="esds:tX509CertItem"
   C:          cn="esds@example.com  "
   C:          o="Afilias Limited.  "
   C:          fingerprint="54f1aafb04f119eacfcefcd12b89d1fa3cfcc727  ">
   C:        </cert>
   C:      </authorizedCertList>
   C:      <eventNotifyTopicList
   C:        xsi:type="esds:tEventTopicItemList"
   C:        action="replace  ">
   C:        <eventTopic
   C:          xsi:type="esds:tEventTopicItem"
   C:          id="topic1  "
   C:          objectIDPattern="urn:epc:id:sgtin:1000.2000.*  ">
   C:          <lifeCycleStepList
   C:            xsi:type="esds:tLifeCycleStepItemList"
   C:            action="replace  ">
   C:            <lifeCycleStep
   C:              xsi:type="esds:tLifeCycleStepItem"
   C:              id="urn:ietf:aero:baggage:create  ">
   C:            </lifeCycleStep>
   C:          </lifeCycleStepList>
   C:          <eventClassList
   C:            xsi:type="esds:tEventClassItemList"
   C:            action="replace  ">
   C:            <eventClass
   C:              xsi:type="esds:tEventClassItem"
   C:              id="C2  ">
   C:            </eventClass>
   C:          </eventClassList>
   C:        </eventTopic>
   C:      </eventNotifyTopicList>
   C:    </esds:UserUpdate>
   C:  </SOAP-ENV:Body>
   C:</SOAP-ENV:Envelope>


5.9.2.  Response

   o  Description:

      When a <UserUpdate> operation has been processed successfully, a
      server will respond with an <UserUpdateResult>.





Thompson                 Expires April 19, 2008                [Page 68]

Internet-Draft                ESDS Commands                 October 2007


   o  Elements:

      *  <result>

         +  Desc: result structure common for each response

         +  Type: tResult

         +  Use: required

      *  <extension>

         +  Desc: user defined extension xml

         +  Type: tExtension

         +  Use: optional, but no more than 1 occurrence(s)



   S:<?xml version="1.0" encoding="utf-8"?>
   S:<SOAP-ENV:Envelope
   S:  xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
   S:  xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
   S:  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
   S:  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
   S:  xmlns:esdsw="urn:ietf:params:wsdl:ns:esds-1.0"
   S:  xmlns:esds="urn:ietf:params:xsd:ns:esds-1.0">
   S:  <SOAP-ENV:Body>
   S:    <esds:UserUpdateResult
   S:      xsi:type="esds:UserUpdateOut">
   S:      <result
   S:        xsi:type="esds:tResult"
   S:        code="1000  "
   S:        desc="COMMAND_COMPLETED_SUCCESSFULLY   ">
   S:        <value
   S:          xsi:type="xs:string">
   S:          value1  </value>
   S:      </result>
   S:      <extension
   S:        xsi:type="esds:tExtension">
   S:      </extension>
   S:    </esds:UserUpdateResult>
   S:  </SOAP-ENV:Body>
   S:</SOAP-ENV:Envelope>






Thompson                 Expires April 19, 2008                [Page 69]

Internet-Draft                ESDS Commands                 October 2007


5.10.  <UserDelete>

5.10.1.  Request

   o  Description:

      The ESDS <UserDelete> operation is used to remove a <User> from
      the ESDS system.  If the <User> is associated with other objects
      within the ESDS, then the <User> will be marked with an "inactive"
      state.

   o  Elements:

      *  <sid>

         +  Desc: session identifier

         +  Type: tSessionID

         +  Use: required

      *  <extension>

         +  Desc: user defined extension xml

         +  Type: tExtension

         +  Use: optional, but no more than 1 occurrence(s)

      *  <userID>

         +  Desc: user identifier

         +  Type: tUserID

         +  Use: required















Thompson                 Expires April 19, 2008                [Page 70]

Internet-Draft                ESDS Commands                 October 2007


   C:<?xml version="1.0" encoding="utf-8"?>
   C:<SOAP-ENV:Envelope
   C:  xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
   C:  xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
   C:  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
   C:  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
   C:  xmlns:esdsw="urn:ietf:params:wsdl:ns:esds-1.0"
   C:  xmlns:esds="urn:ietf:params:xsd:ns:esds-1.0">
   C:  <SOAP-ENV:Body>
   C:    <esds:UserDelete
   C:      xsi:type="esds:UserDeleteIn">
   C:      <sid
   C:        xsi:type="esds:tSessionID">
   C:        41xM1R6VD66l5Jb1HO8462Q7hWgDtWr4  </sid>
   C:      <extension
   C:        xsi:type="esds:tExtension">
   C:      </extension>
   C:      <userID
   C:        xsi:type="esds:tUserID">
   C:        U001  </userID>
   C:    </esds:UserDelete>
   C:  </SOAP-ENV:Body>
   C:</SOAP-ENV:Envelope>


5.10.2.  Response

   o  Description:

      When a <UserDelete> operation has been processed successfully, a
      server will respond with an <UserDeleteResult>.

   o  Elements:

      *  <result>

         +  Desc: result structure common for each response

         +  Type: tResult

         +  Use: required

      *  <extension>

         +  Desc: user defined extension xml

         +  Type: tExtension




Thompson                 Expires April 19, 2008                [Page 71]

Internet-Draft                ESDS Commands                 October 2007


         +  Use: optional, but no more than 1 occurrence(s)



   S:<?xml version="1.0" encoding="utf-8"?>
   S:<SOAP-ENV:Envelope
   S:  xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
   S:  xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
   S:  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
   S:  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
   S:  xmlns:esdsw="urn:ietf:params:wsdl:ns:esds-1.0"
   S:  xmlns:esds="urn:ietf:params:xsd:ns:esds-1.0">
   S:  <SOAP-ENV:Body>
   S:    <esds:UserDeleteResult
   S:      xsi:type="esds:UserDeleteOut">
   S:      <result
   S:        xsi:type="esds:tResult"
   S:        code="1000  "
   S:        desc="COMMAND_COMPLETED_SUCCESSFULLY   ">
   S:        <value
   S:          xsi:type="xs:string">
   S:          value1  </value>
   S:      </result>
   S:      <extension
   S:        xsi:type="esds:tExtension">
   S:      </extension>
   S:    </esds:UserDeleteResult>
   S:  </SOAP-ENV:Body>
   S:</SOAP-ENV:Envelope>


5.11.  <UserLookup>

5.11.1.  Request

   o  Description:

      The ESDS <UserLookup> operation is used to query a set of partners
      that match the search criteria specified as request parameter
      elements.

   o  Elements:

      *  <sid>

         +  Desc: session identifier





Thompson                 Expires April 19, 2008                [Page 72]

Internet-Draft                ESDS Commands                 October 2007


         +  Type: tSessionID

         +  Use: required

      *  <extension>

         +  Desc: user defined extension xml

         +  Type: tExtension

         +  Use: optional, but no more than 1 occurrence(s)

      *  <userID>

         +  Desc: user identifier

         +  Type: tUserID

         +  Use: required



   C:<?xml version="1.0" encoding="utf-8"?>
   C:<SOAP-ENV:Envelope
   C:  xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
   C:  xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
   C:  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
   C:  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
   C:  xmlns:esdsw="urn:ietf:params:wsdl:ns:esds-1.0"
   C:  xmlns:esds="urn:ietf:params:xsd:ns:esds-1.0">
   C:  <SOAP-ENV:Body>
   C:    <esds:UserLookup
   C:      xsi:type="esds:UserLookupIn">
   C:      <sid
   C:        xsi:type="esds:tSessionID">
   C:        41xM1R6VD66l5Jb1HO8462Q7hWgDtWr4  </sid>
   C:      <extension
   C:        xsi:type="esds:tExtension">
   C:      </extension>
   C:      <userID
   C:        xsi:type="esds:tUserID">
   C:        U001  </userID>
   C:    </esds:UserLookup>
   C:  </SOAP-ENV:Body>
   C:</SOAP-ENV:Envelope>






Thompson                 Expires April 19, 2008                [Page 73]

Internet-Draft                ESDS Commands                 October 2007


5.11.2.  Response

   o  Description:

      When a <UserLookup> operation has been processed successfully, a
      server will respond with an <UserLookupResult>.

   o  Elements:

      *  <result>

         +  Desc: result structure common for each response

         +  Type: tResult

         +  Use: required

      *  <extension>

         +  Desc: user defined extension xml

         +  Type: tExtension

         +  Use: optional, but no more than 1 occurrence(s)

      *  <userList>

         +  Desc: user list

         +  Type: tUserItemList

         +  Use: required



















Thompson                 Expires April 19, 2008                [Page 74]

Internet-Draft                ESDS Commands                 October 2007


   S:<?xml version="1.0" encoding="utf-8"?>
   S:<SOAP-ENV:Envelope
   S:  xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
   S:  xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
   S:  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
   S:  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
   S:  xmlns:esdsw="urn:ietf:params:wsdl:ns:esds-1.0"
   S:  xmlns:esds="urn:ietf:params:xsd:ns:esds-1.0">
   S:  <SOAP-ENV:Body>
   S:    <esds:UserLookupResult
   S:      xsi:type="esds:UserLookupOut">
   S:      <result
   S:        xsi:type="esds:tResult"
   S:        code="1000  "
   S:        desc="COMMAND_COMPLETED_SUCCESSFULLY   ">
   S:        <value
   S:          xsi:type="xs:string">
   S:          value1  </value>
   S:      </result>
   S:      <extension
   S:        xsi:type="esds:tExtension">
   S:      </extension>
   S:      <userList
   S:        xsi:type="esds:tUserItemList"
   S:        action="replace  ">
   S:        <user
   S:          xsi:type="esds:tUserItem"
   S:          id="U001  "
   S:          uid="100  ">
   S:        </user>
   S:      </userList>
   S:    </esds:UserLookupResult>
   S:  </SOAP-ENV:Body>
   S:</SOAP-ENV:Envelope>


5.12.  <PartnerCreate>

5.12.1.  Request

   o  Description:

      The ESDS <PartnerCreate> operation is used to create new partners
      within the ESDS system. <Partner>s are assigned a <Role> at
      creation time, however this and other attributes can be changed
      with the <PartnerUpdate> operation.





Thompson                 Expires April 19, 2008                [Page 75]

Internet-Draft                ESDS Commands                 October 2007


   o  Elements:

      *  <sid>

         +  Desc: session identifier

         +  Type: tSessionID

         +  Use: required

      *  <extension>

         +  Desc: user defined extension xml

         +  Type: tExtension

         +  Use: optional, but no more than 1 occurrence(s)

      *  <partnerID>

         +  Desc: partner identifier

         +  Type: tPartnerID

         +  Use: required

      *  <serviceList>

         +  Desc: list of services

         +  Type: tServiceItemList

         +  Use: optional, but no more than 1 occurrence(s)


















Thompson                 Expires April 19, 2008                [Page 76]

Internet-Draft                ESDS Commands                 October 2007


   C:<?xml version="1.0" encoding="utf-8"?>
   C:<SOAP-ENV:Envelope
   C:  xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
   C:  xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
   C:  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
   C:  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
   C:  xmlns:esdsw="urn:ietf:params:wsdl:ns:esds-1.0"
   C:  xmlns:esds="urn:ietf:params:xsd:ns:esds-1.0">
   C:  <SOAP-ENV:Body>
   C:    <esds:PartnerCreate
   C:      xsi:type="esds:PartnerCreateIn">
   C:      <sid
   C:        xsi:type="esds:tSessionID">
   C:        41xM1R6VD66l5Jb1HO8462Q7hWgDtWr4  </sid>
   C:      <extension
   C:        xsi:type="esds:tExtension">
   C:      </extension>
   C:      <partnerID
   C:        xsi:type="esds:tPartnerID">
   C:        P001  </partnerID>
   C:      <serviceList
   C:        xsi:type="esds:tServiceItemList"
   C:        action="replace ">
   C:        <service
   C:          xsi:type="esds:tServiceItem"
   C:          id="urn1  "
   C:          type="ds  "
   C:          uri="https://www.example.com/esds  ">
   C:        </service>
   C:      </serviceList>
   C:    </esds:PartnerCreate>
   C:  </SOAP-ENV:Body>
   C:</SOAP-ENV:Envelope>


5.12.2.  Response

   o  Description:

      When a <PartnerCreate> operation has been processed successfully,
      a server will respond with an <PartnerCreateResult>.

   o  Elements:

      *  <result>

         +  Desc: result structure common for each response




Thompson                 Expires April 19, 2008                [Page 77]

Internet-Draft                ESDS Commands                 October 2007


         +  Type: tResult

         +  Use: required

      *  <extension>

         +  Desc: user defined extension xml

         +  Type: tExtension

         +  Use: optional, but no more than 1 occurrence(s)

      *  <partnerUID>

         +  Desc: partner unique identifier

         +  Type: tSmallUID

         +  Use: required



   S:<?xml version="1.0" encoding="utf-8"?>
   S:<SOAP-ENV:Envelope
   S:  xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
   S:  xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
   S:  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
   S:  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
   S:  xmlns:esdsw="urn:ietf:params:wsdl:ns:esds-1.0"
   S:  xmlns:esds="urn:ietf:params:xsd:ns:esds-1.0">
   S:  <SOAP-ENV:Body>
   S:    <esds:PartnerCreateResult
   S:      xsi:type="esds:PartnerCreateOut">
   S:      <result
   S:        xsi:type="esds:tResult"
   S:        code="1000  "
   S:        desc="COMMAND_COMPLETED_SUCCESSFULLY   ">
   S:        <value
   S:          xsi:type="xs:string">
   S:          value1  </value>
   S:      </result>
   S:      <extension
   S:        xsi:type="esds:tExtension">
   S:      </extension>
   S:      <partnerUID
   S:        xsi:type="esds:tSmallUID">
   S:        100  </partnerUID>
   S:    </esds:PartnerCreateResult>



Thompson                 Expires April 19, 2008                [Page 78]

Internet-Draft                ESDS Commands                 October 2007


   S:  </SOAP-ENV:Body>
   S:</SOAP-ENV:Envelope>


5.13.  <PartnerInfo>

5.13.1.  Request

   o  Description:

      The ESDS <PartnerInfo> operation is used to query the details of
      an individual <Partner> in the ESDS.  The <Partner> to be queried
      is located by the unique <partnerID> used to create the <Partner>
      in the system.

   o  Elements:

      *  <sid>

         +  Desc: session identifier

         +  Type: tSessionID

         +  Use: required

      *  <extension>

         +  Desc: user defined extension xml

         +  Type: tExtension

         +  Use: optional, but no more than 1 occurrence(s)

      *  <partnerID>

         +  Desc: partner identifier

         +  Type: tPartnerID

         +  Use: required











Thompson                 Expires April 19, 2008                [Page 79]

Internet-Draft                ESDS Commands                 October 2007


   C:<?xml version="1.0" encoding="utf-8"?>
   C:<SOAP-ENV:Envelope
   C:  xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
   C:  xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
   C:  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
   C:  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
   C:  xmlns:esdsw="urn:ietf:params:wsdl:ns:esds-1.0"
   C:  xmlns:esds="urn:ietf:params:xsd:ns:esds-1.0">
   C:  <SOAP-ENV:Body>
   C:    <esds:PartnerInfo
   C:      xsi:type="esds:PartnerInfoIn">
   C:      <sid
   C:        xsi:type="esds:tSessionID">
   C:        41xM1R6VD66l5Jb1HO8462Q7hWgDtWr4  </sid>
   C:      <extension
   C:        xsi:type="esds:tExtension">
   C:      </extension>
   C:      <partnerID
   C:        xsi:type="esds:tPartnerID">
   C:        P001  </partnerID>
   C:    </esds:PartnerInfo>
   C:  </SOAP-ENV:Body>
   C:</SOAP-ENV:Envelope>


5.13.2.  Response

   o  Description:

      When a <PartnerInfo> operation has been processed successfully, a
      server will respond with an <PartnerInfoResult>.

   o  Elements:

      *  <result>

         +  Desc: result structure common for each response

         +  Type: tResult

         +  Use: required

      *  <extension>

         +  Desc: user defined extension xml

         +  Type: tExtension




Thompson                 Expires April 19, 2008                [Page 80]

Internet-Draft                ESDS Commands                 October 2007


         +  Use: optional, but no more than 1 occurrence(s)

      *  <partnerUID>

         +  Desc: partner unique identifier

         +  Type: tSmallUID

         +  Use: required

      *  <partnerID>

         +  Desc: partner identifier

         +  Type: tPartnerID

         +  Use: required

      *  <supplyChainList>

         +  Desc: list of supply chains

         +  Type: tSupplyChainItemList

         +  Use: required

      *  <serviceList>

         +  Desc: list of services

         +  Type: tServiceItemList

         +  Use: required



   S:<?xml version="1.0" encoding="utf-8"?>
   S:<SOAP-ENV:Envelope
   S:  xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
   S:  xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
   S:  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
   S:  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
   S:  xmlns:esdsw="urn:ietf:params:wsdl:ns:esds-1.0"
   S:  xmlns:esds="urn:ietf:params:xsd:ns:esds-1.0">
   S:  <SOAP-ENV:Body>
   S:    <esds:PartnerInfoResult
   S:      xsi:type="esds:PartnerInfoOut">
   S:      <result



Thompson                 Expires April 19, 2008                [Page 81]

Internet-Draft                ESDS Commands                 October 2007


   S:        xsi:type="esds:tResult"
   S:        code="1000  "
   S:        desc="COMMAND_COMPLETED_SUCCESSFULLY   ">
   S:        <value
   S:          xsi:type="xs:string">
   S:          value1  </value>
   S:      </result>
   S:      <extension
   S:        xsi:type="esds:tExtension">
   S:      </extension>
   S:      <partnerUID
   S:        xsi:type="esds:tSmallUID">
   S:        100  </partnerUID>
   S:      <partnerID
   S:        xsi:type="esds:tPartnerID">
   S:        P001  </partnerID>
   S:      <supplyChainList
   S:        xsi:type="esds:tSupplyChainItemList"
   S:        action="replace  ">
   S:        <supplyChain
   S:          xsi:type="esds:tSupplyChainItem"
   S:          id="SC001  "
   S:          uid="101  ">
   S:        </supplyChain>
   S:      </supplyChainList>
   S:      <serviceList
   S:        xsi:type="esds:tServiceItemList"
   S:        action="replace ">
   S:        <service
   S:          xsi:type="esds:tServiceItem"
   S:          id="urn1  "
   S:          type="ds  "
   S:          uri="https://www.example.com/esds  ">
   S:        </service>
   S:      </serviceList>
   S:    </esds:PartnerInfoResult>
   S:  </SOAP-ENV:Body>
   S:</SOAP-ENV:Envelope>


5.14.  <PartnerUpdate>

5.14.1.  Request

   o  Description:

      The ESDS <PartnerUpdate> operation is used to modify the contents
      of the specified <Partner>.



Thompson                 Expires April 19, 2008                [Page 82]

Internet-Draft                ESDS Commands                 October 2007


   o  Elements:

      *  <sid>

         +  Desc: session identifier

         +  Type: tSessionID

         +  Use: required

      *  <extension>

         +  Desc: user defined extension xml

         +  Type: tExtension

         +  Use: optional, but no more than 1 occurrence(s)

      *  <partnerUID>

         +  Desc: partner unique identifier

         +  Type: tSmallUID

         +  Use: required

      *  <partnerID>

         +  Desc: partner identifier

         +  Type: tPartnerID

         +  Use: optional, but no more than 1 occurrence(s)

      *  <serviceList>

         +  Desc: list of services

         +  Type: tServiceItemList

         +  Use: optional, but no more than 1 occurrence(s)










Thompson                 Expires April 19, 2008                [Page 83]

Internet-Draft                ESDS Commands                 October 2007


   C:<?xml version="1.0" encoding="utf-8"?>
   C:<SOAP-ENV:Envelope
   C:  xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
   C:  xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
   C:  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
   C:  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
   C:  xmlns:esdsw="urn:ietf:params:wsdl:ns:esds-1.0"
   C:  xmlns:esds="urn:ietf:params:xsd:ns:esds-1.0">
   C:  <SOAP-ENV:Body>
   C:    <esds:PartnerUpdate
   C:      xsi:type="esds:PartnerUpdateIn">
   C:      <sid
   C:        xsi:type="esds:tSessionID">
   C:        41xM1R6VD66l5Jb1HO8462Q7hWgDtWr4  </sid>
   C:      <extension
   C:        xsi:type="esds:tExtension">
   C:      </extension>
   C:      <partnerUID
   C:        xsi:type="esds:tSmallUID">
   C:        100  </partnerUID>
   C:      <partnerID
   C:        xsi:type="esds:tPartnerID">
   C:        P001  </partnerID>
   C:      <serviceList
   C:        xsi:type="esds:tServiceItemList"
   C:        action="replace ">
   C:        <service
   C:          xsi:type="esds:tServiceItem"
   C:          id="urn1  "
   C:          type="ds  "
   C:          uri="https://www.example.com/esds  ">
   C:        </service>
   C:      </serviceList>
   C:    </esds:PartnerUpdate>
   C:  </SOAP-ENV:Body>
   C:</SOAP-ENV:Envelope>


5.14.2.  Response

   o  Description:

      When a <PartnerUpdate> operation has been processed successfully,
      a server will respond with an <PartnerUpdateResult>.

   o  Elements:





Thompson                 Expires April 19, 2008                [Page 84]

Internet-Draft                ESDS Commands                 October 2007


      *  <result>

         +  Desc: result structure common for each response

         +  Type: tResult

         +  Use: required

      *  <extension>

         +  Desc: user defined extension xml

         +  Type: tExtension

         +  Use: optional, but no more than 1 occurrence(s)



   S:<?xml version="1.0" encoding="utf-8"?>
   S:<SOAP-ENV:Envelope
   S:  xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
   S:  xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
   S:  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
   S:  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
   S:  xmlns:esdsw="urn:ietf:params:wsdl:ns:esds-1.0"
   S:  xmlns:esds="urn:ietf:params:xsd:ns:esds-1.0">
   S:  <SOAP-ENV:Body>
   S:    <esds:PartnerUpdateResult
   S:      xsi:type="esds:PartnerUpdateOut">
   S:      <result
   S:        xsi:type="esds:tResult"
   S:        code="1000  "
   S:        desc="COMMAND_COMPLETED_SUCCESSFULLY   ">
   S:        <value
   S:          xsi:type="xs:string">
   S:          value1  </value>
   S:      </result>
   S:      <extension
   S:        xsi:type="esds:tExtension">
   S:      </extension>
   S:    </esds:PartnerUpdateResult>
   S:  </SOAP-ENV:Body>
   S:</SOAP-ENV:Envelope>








Thompson                 Expires April 19, 2008                [Page 85]

Internet-Draft                ESDS Commands                 October 2007


5.15.  <PartnerDelete>

5.15.1.  Request



   C:<?xml version="1.0" encoding="utf-8"?>
   C:<SOAP-ENV:Envelope
   C:  xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
   C:  xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
   C:  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
   C:  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
   C:  xmlns:esdsw="urn:ietf:params:wsdl:ns:esds-1.0"
   C:  xmlns:esds="urn:ietf:params:xsd:ns:esds-1.0">
   C:  <SOAP-ENV:Body>
   C:    <esds:PartnerDelete
   C:      xsi:type="esds:PartnerDeleteIn">
   C:      <sid
   C:        xsi:type="esds:tSessionID">
   C:        41xM1R6VD66l5Jb1HO8462Q7hWgDtWr4  </sid>
   C:      <extension
   C:        xsi:type="esds:tExtension">
   C:      </extension>
   C:      <partnerID
   C:        xsi:type="esds:tPartnerID">
   C:        P001  </partnerID>
   C:    </esds:PartnerDelete>
   C:  </SOAP-ENV:Body>
   C:</SOAP-ENV:Envelope>


5.15.2.  Response

   o  Description:

      When a <PartnerDelete> operation has been processed successfully,
      a server will respond with an <PartnerDeleteResult>.

   o  Elements:

      *  <result>

         +  Desc: result structure common for each response

         +  Type: tResult

         +  Use: required




Thompson                 Expires April 19, 2008                [Page 86]

Internet-Draft                ESDS Commands                 October 2007


      *  <extension>

         +  Desc: user defined extension xml

         +  Type: tExtension

         +  Use: optional, but no more than 1 occurrence(s)



   S:<?xml version="1.0" encoding="utf-8"?>
   S:<SOAP-ENV:Envelope
   S:  xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
   S:  xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
   S:  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
   S:  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
   S:  xmlns:esdsw="urn:ietf:params:wsdl:ns:esds-1.0"
   S:  xmlns:esds="urn:ietf:params:xsd:ns:esds-1.0">
   S:  <SOAP-ENV:Body>
   S:    <esds:PartnerDeleteResult
   S:      xsi:type="esds:PartnerDeleteOut">
   S:      <result
   S:        xsi:type="esds:tResult"
   S:        code="1000  "
   S:        desc="COMMAND_COMPLETED_SUCCESSFULLY   ">
   S:        <value
   S:          xsi:type="xs:string">
   S:          value1  </value>
   S:      </result>
   S:      <extension
   S:        xsi:type="esds:tExtension">
   S:      </extension>
   S:    </esds:PartnerDeleteResult>
   S:  </SOAP-ENV:Body>
   S:</SOAP-ENV:Envelope>


5.16.  <PartnerLookup>

5.16.1.  Request











Thompson                 Expires April 19, 2008                [Page 87]

Internet-Draft                ESDS Commands                 October 2007


   C:<?xml version="1.0" encoding="utf-8"?>
   C:<SOAP-ENV:Envelope
   C:  xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
   C:  xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
   C:  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
   C:  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
   C:  xmlns:esdsw="urn:ietf:params:wsdl:ns:esds-1.0"
   C:  xmlns:esds="urn:ietf:params:xsd:ns:esds-1.0">
   C:  <SOAP-ENV:Body>
   C:    <esds:PartnerLookup
   C:      xsi:type="esds:PartnerLookupIn">
   C:      <sid
   C:        xsi:type="esds:tSessionID">
   C:        41xM1R6VD66l5Jb1HO8462Q7hWgDtWr4  </sid>
   C:      <extension
   C:        xsi:type="esds:tExtension">
   C:      </extension>
   C:      <partnerID
   C:        xsi:type="esds:tPartnerID">
   C:        P001  </partnerID>
   C:    </esds:PartnerLookup>
   C:  </SOAP-ENV:Body>
   C:</SOAP-ENV:Envelope>


5.16.2.  Response

   o  Description:

      When a <PartnerLookup> operation has been processed successfully,
      a server will respond with an <PartnerLookupResult>.

   o  Elements:

      *  <result>

         +  Desc: result structure common for each response

         +  Type: tResult

         +  Use: required

      *  <extension>

         +  Desc: user defined extension xml

         +  Type: tExtension




Thompson                 Expires April 19, 2008                [Page 88]

Internet-Draft                ESDS Commands                 October 2007


         +  Use: optional, but no more than 1 occurrence(s)

      *  <partnerList>

         +  Desc: list of partners

         +  Type: tPartnerItemList

         +  Use: required



   S:<?xml version="1.0" encoding="utf-8"?>
   S:<SOAP-ENV:Envelope
   S:  xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
   S:  xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
   S:  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
   S:  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
   S:  xmlns:esdsw="urn:ietf:params:wsdl:ns:esds-1.0"
   S:  xmlns:esds="urn:ietf:params:xsd:ns:esds-1.0">
   S:  <SOAP-ENV:Body>
   S:    <esds:PartnerLookupResult
   S:      xsi:type="esds:PartnerLookupOut">
   S:      <result
   S:        xsi:type="esds:tResult"
   S:        code="1000  "
   S:        desc="COMMAND_COMPLETED_SUCCESSFULLY   ">
   S:        <value
   S:          xsi:type="xs:string">
   S:          value1  </value>
   S:      </result>
   S:      <extension
   S:        xsi:type="esds:tExtension">
   S:      </extension>
   S:      <partnerList
   S:        xsi:type="esds:tPartnerItemList"
   S:        action="add  ">
   S:        <partner
   S:          xsi:type="esds:tPartnerItem"
   S:          id="P001  "
   S:          uid="100  "
   S:          authority="true  ">
   S:        </partner>
   S:      </partnerList>
   S:    </esds:PartnerLookupResult>
   S:  </SOAP-ENV:Body>
   S:</SOAP-ENV:Envelope>




Thompson                 Expires April 19, 2008                [Page 89]

Internet-Draft                ESDS Commands                 October 2007


5.17.  <SupplyChainCreate>

5.17.1.  Request

   o  Description:

      The ESDS <SupplychainCreate> operation is used to create
      <Supplychain>s in the ESDS system.

   o  Elements:

      *  <sid>

         +  Desc: session identifier

         +  Type: tSessionID

         +  Use: required

      *  <extension>

         +  Desc: user defined extension xml

         +  Type: tExtension

         +  Use: optional, but no more than 1 occurrence(s)

      *  <supplyChainID>

         +  Desc: supply chain identifier

         +  Type: tSupplyChainID

         +  Use: required

      *  <partnerList>

         +  Desc: list of partners

         +  Type: tPartnerItemList

         +  Use: optional, but no more than 1 occurrence(s)

      *  <eventDenyList>

         +  Desc: list of event deny entries





Thompson                 Expires April 19, 2008                [Page 90]

Internet-Draft                ESDS Commands                 October 2007


         +  Type: tEventDenyItemList

         +  Use: optional, but no more than 1 occurrence(s)

      *  <lifeCycleAllowList>

         +  Desc: list of life cycle allow entries

         +  Type: tEventLifeCycleStepAllowItemList

         +  Use: optional, but no more than 1 occurrence(s)



   C:<?xml version="1.0" encoding="utf-8"?>
   C:<SOAP-ENV:Envelope
   C:  xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
   C:  xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
   C:  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
   C:  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
   C:  xmlns:esdsw="urn:ietf:params:wsdl:ns:esds-1.0"
   C:  xmlns:esds="urn:ietf:params:xsd:ns:esds-1.0">
   C:  <SOAP-ENV:Body>
   C:    <esds:SupplyChainCreate
   C:      xsi:type="esds:SupplyChainCreateIn">
   C:      <sid
   C:        xsi:type="esds:tSessionID">
   C:        41xM1R6VD66l5Jb1HO8462Q7hWgDtWr4  </sid>
   C:      <extension
   C:        xsi:type="esds:tExtension">
   C:      </extension>
   C:      <supplyChainID
   C:        xsi:type="esds:tSupplyChainID">
   C:        SC001 </supplyChainID>
   C:      <partnerList
   C:        xsi:type="esds:tPartnerItemList"
   C:        action="add  ">
   C:        <partner
   C:          xsi:type="esds:tPartnerItem"
   C:          id="P001  "
   C:          uid="100  "
   C:          authority="true  ">
   C:        </partner>
   C:      </partnerList>
   C:      <eventDenyList
   C:        xsi:type="esds:tEventDenyItemList"
   C:        action="replace  ">
   C:        <deny



Thompson                 Expires April 19, 2008                [Page 91]

Internet-Draft                ESDS Commands                 October 2007


   C:          xsi:type="esds:tEventDenyItem"
   C:          status="active  "
   C:          supplyChainID="SC001  "
   C:          partnerID="P001  "
   C:          userID="U001  "
   C:          objectIDPattern="urn:epc:id:sgtin:1000.2000.*  "
   C:          startingAt="2006-12-01T00:00:01.123Z  "
   C:          endingAt="2006-14-01T00:00:01.123Z  ">
   C:        </deny>
   C:      </eventDenyList>
   C:      <lifeCycleAllowList
   C:        xsi:type="esds:tEventLifeCycleStepAllowItemList"
   C:        action="replace  ">
   C:        <allow
   C:          xsi:type="esds:tEventLifeCycleStepAllowItem"
   C:          partnerID="P002  "
   C:          lifeCycleStepID="urn:ietf:aero:baggage:create  "
   C:          accessMode="read  "
   C:          userID="U001  ">
   C:        </allow>
   C:      </lifeCycleAllowList>
   C:    </esds:SupplyChainCreate>
   C:  </SOAP-ENV:Body>
   C:</SOAP-ENV:Envelope>


5.17.2.  Response

   o  Description:

      When a <SupplychainCreate> operation has been processed
      successfully, a server will respond with a
      <SupplychainCreateResult>.

   o  Elements:

      *  <result>

         +  Desc: result structure common for each response

         +  Type: tResult

         +  Use: required

      *  <extension>

         +  Desc: user defined extension xml




Thompson                 Expires April 19, 2008                [Page 92]

Internet-Draft                ESDS Commands                 October 2007


         +  Type: tExtension

         +  Use: optional, but no more than 1 occurrence(s)

      *  <supplyChainUID>

         +  Desc: supply chain unique identifier

         +  Type: tSmallUID

         +  Use: required



   S:<?xml version="1.0" encoding="utf-8"?>
   S:<SOAP-ENV:Envelope
   S:  xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
   S:  xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
   S:  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
   S:  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
   S:  xmlns:esdsw="urn:ietf:params:wsdl:ns:esds-1.0"
   S:  xmlns:esds="urn:ietf:params:xsd:ns:esds-1.0">
   S:  <SOAP-ENV:Body>
   S:    <esds:SupplyChainCreateResult
   S:      xsi:type="esds:SupplyChainCreateOut">
   S:      <result
   S:        xsi:type="esds:tResult"
   S:        code="1000  "
   S:        desc="COMMAND_COMPLETED_SUCCESSFULLY   ">
   S:        <value
   S:          xsi:type="xs:string">
   S:          value1  </value>
   S:      </result>
   S:      <extension
   S:        xsi:type="esds:tExtension">
   S:      </extension>
   S:      <supplyChainUID
   S:        xsi:type="esds:tSmallUID">
   S:        100  </supplyChainUID>
   S:    </esds:SupplyChainCreateResult>
   S:  </SOAP-ENV:Body>
   S:</SOAP-ENV:Envelope>









Thompson                 Expires April 19, 2008                [Page 93]

Internet-Draft                ESDS Commands                 October 2007


5.18.  <SupplyChainInfo>

5.18.1.  Request

   o  Description:

      The ESDS <SupplychainInfo> operation is used to query the details
      of an individual <Supplychain> in the ESDS.  The <Supplychain> to
      be queried is located by the unique <supplychainID> used to create
      the <Supplychain> in the system.

   o  Elements:

      *  <sid>

         +  Desc: session identifier

         +  Type: tSessionID

         +  Use: required

      *  <extension>

         +  Desc: user defined extension xml

         +  Type: tExtension

         +  Use: optional, but no more than 1 occurrence(s)

      *  <supplyChainID>

         +  Desc: supply chain identifier

         +  Type: tSupplyChainID

         +  Use: required















Thompson                 Expires April 19, 2008                [Page 94]

Internet-Draft                ESDS Commands                 October 2007


   C:<?xml version="1.0" encoding="utf-8"?>
   C:<SOAP-ENV:Envelope
   C:  xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
   C:  xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
   C:  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
   C:  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
   C:  xmlns:esdsw="urn:ietf:params:wsdl:ns:esds-1.0"
   C:  xmlns:esds="urn:ietf:params:xsd:ns:esds-1.0">
   C:  <SOAP-ENV:Body>
   C:    <esds:SupplyChainInfo
   C:      xsi:type="esds:SupplyChainInfoIn">
   C:      <sid
   C:        xsi:type="esds:tSessionID">
   C:        41xM1R6VD66l5Jb1HO8462Q7hWgDtWr4  </sid>
   C:      <extension
   C:        xsi:type="esds:tExtension">
   C:      </extension>
   C:      <supplyChainID
   C:        xsi:type="esds:tSupplyChainID">
   C:        SC001 </supplyChainID>
   C:    </esds:SupplyChainInfo>
   C:  </SOAP-ENV:Body>
   C:</SOAP-ENV:Envelope>


5.18.2.  Response

   o  Description:

      When a <SupplychainInfo> operation has been processed
      successfully, a server will respond with a
      <SupplychainInfoResult>.

   o  Elements:

      *  <result>

         +  Desc: result structure common for each response

         +  Type: tResult

         +  Use: required

      *  <extension>

         +  Desc: user defined extension xml





Thompson                 Expires April 19, 2008                [Page 95]

Internet-Draft                ESDS Commands                 October 2007


         +  Type: tExtension

         +  Use: optional, but no more than 1 occurrence(s)

      *  <supplyChainUID>

         +  Desc: supply chain unique identifier

         +  Type: tSmallUID

         +  Use: required

      *  <supplyChainID>

         +  Desc: supply chain identifier

         +  Type: tSupplyChainID

         +  Use: required

      *  <partnerList>

         +  Desc: list of partners

         +  Type: tPartnerItemList

         +  Use: optional, but no more than 1 occurrence(s)
























Thompson                 Expires April 19, 2008                [Page 96]

Internet-Draft                ESDS Commands                 October 2007


   S:<?xml version="1.0" encoding="utf-8"?>
   S:<SOAP-ENV:Envelope
   S:  xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
   S:  xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
   S:  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
   S:  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
   S:  xmlns:esdsw="urn:ietf:params:wsdl:ns:esds-1.0"
   S:  xmlns:esds="urn:ietf:params:xsd:ns:esds-1.0">
   S:  <SOAP-ENV:Body>
   S:    <esds:SupplyChainInfoResult
   S:      xsi:type="esds:SupplyChainInfoOut">
   S:      <result
   S:        xsi:type="esds:tResult"
   S:        code="1000  "
   S:        desc="COMMAND_COMPLETED_SUCCESSFULLY   ">
   S:        <value
   S:          xsi:type="xs:string">
   S:          value1  </value>
   S:      </result>
   S:      <extension
   S:        xsi:type="esds:tExtension">
   S:      </extension>
   S:      <supplyChainUID
   S:        xsi:type="esds:tSmallUID">
   S:        100  </supplyChainUID>
   S:      <supplyChainID
   S:        xsi:type="esds:tSupplyChainID">
   S:        SC001 </supplyChainID>
   S:      <partnerList
   S:        xsi:type="esds:tPartnerItemList"
   S:        action="add  ">
   S:        <partner
   S:          xsi:type="esds:tPartnerItem"
   S:          id="P001  "
   S:          uid="100  "
   S:          authority="true  ">
   S:        </partner>
   S:      </partnerList>
   S:    </esds:SupplyChainInfoResult>
   S:  </SOAP-ENV:Body>
   S:</SOAP-ENV:Envelope>


5.19.  <SupplyChainUpdate>







Thompson                 Expires April 19, 2008                [Page 97]

Internet-Draft                ESDS Commands                 October 2007


5.19.1.  Request

   o  Description:

      The ESDS <SupplychainUpdate> operation is used to modify the
      contents of the specified <Supplychain>.

   o  Elements:

      *  <sid>

         +  Desc: session identifier

         +  Type: tSessionID

         +  Use: required

      *  <extension>

         +  Desc: user defined extension xml

         +  Type: tExtension

         +  Use: optional, but no more than 1 occurrence(s)

      *  <supplyChainUID>

         +  Desc: supply chain unique identifier

         +  Type: tSmallUID

         +  Use: required

      *  <supplyChainID>

         +  Desc: supply chain identifier

         +  Type: tSupplyChainID

         +  Use: optional, but no more than 1 occurrence(s)

      *  <partnerList>

         +  Desc: list of partners

         +  Type: tPartnerItemList





Thompson                 Expires April 19, 2008                [Page 98]

Internet-Draft                ESDS Commands                 October 2007


         +  Use: optional, but no more than 1 occurrence(s)



   C:<?xml version="1.0" encoding="utf-8"?>
   C:<SOAP-ENV:Envelope
   C:  xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
   C:  xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
   C:  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
   C:  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
   C:  xmlns:esdsw="urn:ietf:params:wsdl:ns:esds-1.0"
   C:  xmlns:esds="urn:ietf:params:xsd:ns:esds-1.0">
   C:  <SOAP-ENV:Body>
   C:    <esds:SupplyChainUpdate
   C:      xsi:type="esds:SupplyChainUpdateIn">
   C:      <sid
   C:        xsi:type="esds:tSessionID">
   C:        41xM1R6VD66l5Jb1HO8462Q7hWgDtWr4  </sid>
   C:      <extension
   C:        xsi:type="esds:tExtension">
   C:      </extension>
   C:      <supplyChainUID
   C:        xsi:type="esds:tSmallUID">
   C:        100  </supplyChainUID>
   C:      <supplyChainID
   C:        xsi:type="esds:tSupplyChainID">
   C:        SC001 </supplyChainID>
   C:      <partnerList
   C:        xsi:type="esds:tPartnerItemList"
   C:        action="add  ">
   C:        <partner
   C:          xsi:type="esds:tPartnerItem"
   C:          id="P001  "
   C:          uid="100  "
   C:          authority="true  ">
   C:        </partner>
   C:      </partnerList>
   C:    </esds:SupplyChainUpdate>
   C:  </SOAP-ENV:Body>
   C:</SOAP-ENV:Envelope>


5.19.2.  Response

   o  Description:

      When a <SupplychainUpdate> operation has been processed
      successfully, a server will respond with a



Thompson                 Expires April 19, 2008                [Page 99]

Internet-Draft                ESDS Commands                 October 2007


      <SupplychainUpdateResult>.

   o  Elements:

      *  <result>

         +  Desc: result structure common for each response

         +  Type: tResult

         +  Use: required

      *  <extension>

         +  Desc: user defined extension xml

         +  Type: tExtension

         +  Use: optional, but no more than 1 occurrence(s)



   S:<?xml version="1.0" encoding="utf-8"?>
   S:<SOAP-ENV:Envelope
   S:  xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
   S:  xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
   S:  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
   S:  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
   S:  xmlns:esdsw="urn:ietf:params:wsdl:ns:esds-1.0"
   S:  xmlns:esds="urn:ietf:params:xsd:ns:esds-1.0">
   S:  <SOAP-ENV:Body>
   S:    <esds:SupplyChainUpdateResult
   S:      xsi:type="esds:SupplyChainUpdateOut">
   S:      <result
   S:        xsi:type="esds:tResult"
   S:        code="1000  "
   S:        desc="COMMAND_COMPLETED_SUCCESSFULLY   ">
   S:        <value
   S:          xsi:type="xs:string">
   S:          value1  </value>
   S:      </result>
   S:      <extension
   S:        xsi:type="esds:tExtension">
   S:      </extension>
   S:    </esds:SupplyChainUpdateResult>
   S:  </SOAP-ENV:Body>
   S:</SOAP-ENV:Envelope>




Thompson                 Expires April 19, 2008               [Page 100]

Internet-Draft                ESDS Commands                 October 2007


5.20.  <SupplyChainDelete>

5.20.1.  Request

   o  Description:

      The ESDS <SupplychainDelete> operation is used to remove a
      <Supplychain> from the ESDS system.  If the <Supplychain> is
      associated with other objects within the ESDS, then the
      <Supplychain> will be marked with an "inactive" state.

   o  Elements:

      *  <sid>

         +  Desc: session identifier

         +  Type: tSessionID

         +  Use: required

      *  <extension>

         +  Desc: user defined extension xml

         +  Type: tExtension

         +  Use: optional, but no more than 1 occurrence(s)

      *  <supplyChainID>

         +  Desc: supply chain identifier

         +  Type: tSupplyChainID

         +  Use: required















Thompson                 Expires April 19, 2008               [Page 101]

Internet-Draft                ESDS Commands                 October 2007


   C:<?xml version="1.0" encoding="utf-8"?>
   C:<SOAP-ENV:Envelope
   C:  xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
   C:  xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
   C:  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
   C:  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
   C:  xmlns:esdsw="urn:ietf:params:wsdl:ns:esds-1.0"
   C:  xmlns:esds="urn:ietf:params:xsd:ns:esds-1.0">
   C:  <SOAP-ENV:Body>
   C:    <esds:SupplyChainDelete
   C:      xsi:type="esds:SupplyChainDeleteIn">
   C:      <sid
   C:        xsi:type="esds:tSessionID">
   C:        41xM1R6VD66l5Jb1HO8462Q7hWgDtWr4  </sid>
   C:      <extension
   C:        xsi:type="esds:tExtension">
   C:      </extension>
   C:      <supplyChainID
   C:        xsi:type="esds:tSupplyChainID">
   C:        SC001 </supplyChainID>
   C:    </esds:SupplyChainDelete>
   C:  </SOAP-ENV:Body>
   C:</SOAP-ENV:Envelope>


5.20.2.  Response

   o  Description:

      When a <SupplychainDelete> operation has been processed
      successfully, a server will respond with a
      <SupplychainDeleteResult>.

   o  Elements:

      *  <result>

         +  Desc: result structure common for each response

         +  Type: tResult

         +  Use: required

      *  <extension>

         +  Desc: user defined extension xml





Thompson                 Expires April 19, 2008               [Page 102]

Internet-Draft                ESDS Commands                 October 2007


         +  Type: tExtension

         +  Use: optional, but no more than 1 occurrence(s)



   S:<?xml version="1.0" encoding="utf-8"?>
   S:<SOAP-ENV:Envelope
   S:  xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
   S:  xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
   S:  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
   S:  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
   S:  xmlns:esdsw="urn:ietf:params:wsdl:ns:esds-1.0"
   S:  xmlns:esds="urn:ietf:params:xsd:ns:esds-1.0">
   S:  <SOAP-ENV:Body>
   S:    <esds:SupplyChainDeleteResult
   S:      xsi:type="esds:SupplyChainDeleteOut">
   S:      <result
   S:        xsi:type="esds:tResult"
   S:        code="1000  "
   S:        desc="COMMAND_COMPLETED_SUCCESSFULLY   ">
   S:        <value
   S:          xsi:type="xs:string">
   S:          value1  </value>
   S:      </result>
   S:      <extension
   S:        xsi:type="esds:tExtension">
   S:      </extension>
   S:    </esds:SupplyChainDeleteResult>
   S:  </SOAP-ENV:Body>
   S:</SOAP-ENV:Envelope>


5.21.  <SupplyChainLookup>

5.21.1.  Request

   o  Description:

      The ESDS <SupplychainLookup> operation is used to query a set of
      partners that match the search criteria specified as request
      parameter elements.

   o  Elements:

      *  <sid>





Thompson                 Expires April 19, 2008               [Page 103]

Internet-Draft                ESDS Commands                 October 2007


         +  Desc: session identifier

         +  Type: tSessionID

         +  Use: required

      *  <extension>

         +  Desc: user defined extension xml

         +  Type: tExtension

         +  Use: optional, but no more than 1 occurrence(s)

      *  <supplyChainID>

         +  Desc: supply chain identifier

         +  Type: tSupplyChainID

         +  Use: required



   C:<?xml version="1.0" encoding="utf-8"?>
   C:<SOAP-ENV:Envelope
   C:  xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
   C:  xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
   C:  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
   C:  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
   C:  xmlns:esdsw="urn:ietf:params:wsdl:ns:esds-1.0"
   C:  xmlns:esds="urn:ietf:params:xsd:ns:esds-1.0">
   C:  <SOAP-ENV:Body>
   C:    <esds:SupplyChainLookup
   C:      xsi:type="esds:SupplyChainLookupIn">
   C:      <sid
   C:        xsi:type="esds:tSessionID">
   C:        41xM1R6VD66l5Jb1HO8462Q7hWgDtWr4  </sid>
   C:      <extension
   C:        xsi:type="esds:tExtension">
   C:      </extension>
   C:      <supplyChainID
   C:        xsi:type="esds:tSupplyChainID">
   C:        SC001 </supplyChainID>
   C:    </esds:SupplyChainLookup>
   C:  </SOAP-ENV:Body>
   C:</SOAP-ENV:Envelope>




Thompson                 Expires April 19, 2008               [Page 104]

Internet-Draft                ESDS Commands                 October 2007


5.21.2.  Response

   o  Description:

      When a <SupplychainLookup> operation has been processed
      successfully, a server will respond with an
      <SupplychainLookupResult>.

   o  Elements:

      *  <result>

         +  Desc: result structure common for each response

         +  Type: tResult

         +  Use: required

      *  <extension>

         +  Desc: user defined extension xml

         +  Type: tExtension

         +  Use: optional, but no more than 1 occurrence(s)

      *  <supplyChainList>

         +  Desc: list of supply chains

         +  Type: tSupplyChainItemList

         +  Use: required


















Thompson                 Expires April 19, 2008               [Page 105]

Internet-Draft                ESDS Commands                 October 2007


   S:<?xml version="1.0" encoding="utf-8"?>
   S:<SOAP-ENV:Envelope
   S:  xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
   S:  xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
   S:  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
   S:  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
   S:  xmlns:esdsw="urn:ietf:params:wsdl:ns:esds-1.0"
   S:  xmlns:esds="urn:ietf:params:xsd:ns:esds-1.0">
   S:  <SOAP-ENV:Body>
   S:    <esds:SupplyChainLookupResult
   S:      xsi:type="esds:SupplyChainLookupOut">
   S:      <result
   S:        xsi:type="esds:tResult"
   S:        code="1000  "
   S:        desc="COMMAND_COMPLETED_SUCCESSFULLY   ">
   S:        <value
   S:          xsi:type="xs:string">
   S:          value1  </value>
   S:      </result>
   S:      <extension
   S:        xsi:type="esds:tExtension">
   S:      </extension>
   S:      <supplyChainList
   S:        xsi:type="esds:tSupplyChainItemList"
   S:        action="replace  ">
   S:        <supplyChain
   S:          xsi:type="esds:tSupplyChainItem"
   S:          id="SC001  "
   S:          uid="101  ">
   S:        </supplyChain>
   S:      </supplyChainList>
   S:    </esds:SupplyChainLookupResult>
   S:  </SOAP-ENV:Body>
   S:</SOAP-ENV:Envelope>

















Thompson                 Expires April 19, 2008               [Page 106]

Internet-Draft                ESDS Commands                 October 2007


6.  IANA Considerations

   This document has no actions for IANA.
















































Thompson                 Expires April 19, 2008               [Page 107]

Internet-Draft                ESDS Commands                 October 2007


7.  Security Considerations

   The ESDS service requires valid identity of all connected users via a
   trusted X.509 certificate signed by a trusted ESDS Certificate
   Authority (CA).  This will be validated by the ESDS system at
   connection time and only clients that meet this initial connection
   requirement will be allowed to proceed.  There will be an offline
   process to apply for and acquire a signed X.509 client certificiate
   that will be able to connect to an ESDS service.  Once a partner has
   this client certificate, connections can be made to the ESDS web
   service.

   Security within the ESDS is layered as follows:

   o  ESDS X.509 Certificate Authority (ESDS-CA) signs and issues client
      certificates.  Only client certificates signed by the ESDS-CA will
      be accepted as trusted certificates.  [RFC3280]

   o  HTTPS transport security if HTTP is the chosen transport protocol
      for the ESDS protocol.  [RFC2818]

   o  PLAIN SASL (Simple Authentication and Security Layer) identifier
      and password as plain text for login authentication.  Plain text
      will be encrypted inside the HTTPS connection as part of the SSL
      transport.

   o  <UserLogin> verifies X.509 client certificate CN (Common Name) and
      O (Organization) fields match the values associated with the
      partner the user belongs to as an added security measure.  Thus,
      only certificates on record in the ESDS will be allowed to
      connect, even if they are signed by the ESDS-CA.

   o  Multiple user accounts with role-based permissions will be
      assigned to partners, enabling them to control their user access
      to the ESDS.

   o  A partner is associated with a supply chain only by partners
      within the supply chain that have been granted authority to add
      partners.

   o  <EventInfo>, <EventLookup>, <EventHistory> visibility is based on
      partner ownership, supply chain membership and partner ACL (Access
      Control List) access.

   o  <voidEvent> type permissible only by the partner that created the
      original non-void event.





Thompson                 Expires April 19, 2008               [Page 108]

Internet-Draft                ESDS Commands                 October 2007


8.  References

8.1.  Normative References

   [RFC2119]  Bradner, S., "Key words for use in RFCs to Indicate
              Requirement Levels", BCP 14, RFC 2119, March 1997.

   [RFC2616]  Fielding, R., Gettys, J., Mogul, J., Frystyk, H.,
              Masinter, L., Leach, P., and T. Berners-Lee, "Hypertext
              Transfer Protocol -- HTTP/1.1", RFC 2616, June 1999.

   [RFC2818]  Rescorla, E., "HTTP Over TLS", RFC 2818, May 2000.

   [RFC2821]  Klensin, J., "Simple Mail Transfer Protocol", RFC 2821,
              April 2001.

   [RFC3280]  Housley, R., Polk, W., Ford, W., and D. Solo, "Internet
              X.509 Public Key Infrastructure Certificate and
              Certificate Revocation List (CRL) Profile", RFC 3280,
              April 2002.

   [RFC4930]  Hollenbeck, S., "Extensible Provisioning Protocol (EPP)",
              RFC 4930, May 2007.

8.2.  Informative References

   [draft-thompson-esds-schema]
              Thompson, F., "Extensible Supply-chain Discovery Service
              Schema (work in progress)", April 2007.

   [draft-young-esds-concepts]
              Young, M., "Extensible Supply-chain Discovery Service
              Concepts (work in progress)", April 2007.


















Thompson                 Expires April 19, 2008               [Page 109]

Internet-Draft                ESDS Commands                 October 2007


Author's Address

   Frank Thompson
   Afilias Canada
   204-4141 Yonge Street
   Toronto, ON  M2P 2A8
   CA

   Phone: +1.416.646.3304
   Email: fot@ca.afilias.info









































Thompson                 Expires April 19, 2008               [Page 110]

Internet-Draft                ESDS Commands                 October 2007


Full Copyright Statement

   Copyright (C) The IETF Trust (2007).

   This document is subject to the rights, licenses and restrictions
   contained in BCP 78, and except as set forth therein, the authors
   retain all their rights.

   This document and the information contained herein are provided on an
   "AS IS" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/SHE REPRESENTS
   OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY, THE IETF TRUST AND
   THE INTERNET ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS
   OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF
   THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED
   WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.


Intellectual Property

   The IETF takes no position regarding the validity or scope of any
   Intellectual Property Rights or other rights that might be claimed to
   pertain to the implementation or use of the technology described in
   this document or the extent to which any license under such rights
   might or might not be available; nor does it represent that it has
   made any independent effort to identify any such rights.  Information
   on the procedures with respect to rights in RFC documents can be
   found in BCP 78 and BCP 79.

   Copies of IPR disclosures made to the IETF Secretariat and any
   assurances of licenses to be made available, or the result of an
   attempt made to obtain a general license or permission for the use of
   such proprietary rights by implementers or users of this
   specification can be obtained from the IETF on-line IPR repository at
   http://www.ietf.org/ipr.

   The IETF invites any interested party to bring to its attention any
   copyrights, patents or patent applications, or other proprietary
   rights that may cover technology that may be required to implement
   this standard.  Please address the information to the IETF at
   ietf-ipr@ietf.org.


Acknowledgment

   Funding for the RFC Editor function is provided by the IETF
   Administrative Support Activity (IASA).





Thompson                 Expires April 19, 2008               [Page 111]

